[{
  "_id": {
    "$oid": "6367d3bdc0e982553720c472"
  },
  "title": "The Flaw in the Plan",
  "content": "<div class=\"userstuff module\" role=\"article\">\n    <h3 class=\"landmark heading\" id=\"work\">Chapter Text</h3>\n    <p align=\"center\">&nbsp;</p><p align=\"center\">\n  <img src=\"https://68.media.tumblr.com/bca986ffbcb5145e556e048c51fd901e/tumblr_ooku11LDYD1vt868ho1_1280.jpg\" alt=\"a gift\" width=\"412\" height=\"412\">\n</p><p align=\"center\">\n  <em> <strong>&nbsp;I </strong> </em>\n</p><p align=\"center\">\n  <em> <strong>A Gift</strong> </em>\n</p><p align=\"center\">\n  <em> <strong>(Art by Acnara)</strong> </em>\n</p><p align=\"center\">&nbsp;</p><p align=\"center\">&nbsp;</p><hr><p align=\"left\">&nbsp;</p><p align=\"left\">&nbsp;</p><p align=\"left\">&nbsp;</p><p align=\"left\">&nbsp;</p><p align=\"left\">&nbsp;</p><p align=\"left\">&nbsp;</p><p align=\"left\">There was no glory in this.&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p>&nbsp;</p><p></p><div class=\"xcontrast\">\n  <p>Harry stood on shaking legs, fingers quivering at his sides. His hands were empty. The stone was dropped in the woods, lost to grass and sticks and dirt. His wand was resting in his pocket, but it may as well have been on the other side of the world.</p>\n  <p>He would not reach for it. He would not defend himself.</p>\n  <p>There was no glory in this.</p>\n  <p>&nbsp;</p>\n  <p></p>\n  <div>\n    <p>&nbsp;</p>\n    <p></p>\n    <div>\n      <p>\"…Harry Potter…\"</p>\n      <p>Lord Voldemort was a distorted, serpentine apparition on the other side of a veil of smoke. His voice was a whisper, a frigid hiss interwoven with the light crackling of the flames.</p>\n      <p>\"…The Boy Who Lived…\"</p>\n      <p>There was no one else.</p>\n      <p>The Death Eaters fell away, the sounds of Hagrid's muffled shouts became silenced. There was a dying fire, a fractured wizard, and a trembling boy who was now a man with his chin jutted forward and his head held high.</p>\n      <p>The Dark Lord tilted his face to one side almost imperceptibly. Pensively.</p>\n      <p>Harry waited for death. Voldemort lifted his wand, and Harry's thoughts spun with a velocity that painted the world in an adrenaline-soaked blur. His fingers twitched but he did not let his body betray him. He would not move to protect himself. Harry awaited the blow of the killing curse, the end of it all; he would look death in the face unflinchingly, with eyes wide open -</p>\n      <p>\"<em>Legilimens.\"</em></p>\n      <p>The <em>wrong curse</em>.</p>\n      <p>Harry Potter fell into himself.</p>\n      <p>The Dark Lord's mental claws reached in and tore their way through Harry's psyche, dragging him down into his memories in a whirlwind of searing pain.</p>\n      <p>…Lightning flashes of Harry as an infant, wailing in his crib while a man in black robes kneels on the floor at his side, sobbing equally hard, ignoring the baby's cries as he clutches a woman to his chest… Beautiful and crimson, delicate and dead…</p>\n      <p>…Harry as a child, eleven years old and his scar on fire as a stone manifests in his pocket…</p>\n      <p>…The scar, always his scar - memories of its pain and its occasional, accompanied emotions. Voldemort was following that neurological pathway with a manic intensity, and Harry was being strung along for the ride. He tried to fight it, to shake the Dark Lord off, but it was hopeless.</p>\n      <p><em>No,</em> he thought with horror, as Voldemort edged closer and closer to the most damning of realizations.</p>\n      <p>\n        <em>No. No. No.</em>\n      </p>\n      <p>The Dark Lord's power was earth-shattering, devastating. Harry could feel the ghost of an emotion that resembled joy at his pain.</p>\n      <p>\n        <em>Yes.</em>\n      </p>\n      <p>…Harry convulsing on the floor of the Ministry of Magic, burning alive in a scorching pyre of agony as the Dark Lord spoke with his lips, begged with his voice for a death which was denied him…</p>\n      <p>…Sixteen, and feeling detached emotions coursing through his mind in waves of fury, fear and happiness…</p>\n      <p>\n        <em>No, no, no—</em>\n      </p>\n      <p>…Seventeen, and realizing that the Dark Lord had finally divined where the Deathstick rested, at last, at last…</p>\n      <p>...Hallows or horcruxes, hallows or horcruxes…</p>\n      <p>\n        <em>No, no, no—</em>\n      </p>\n      <p>...Hidden underneath of a wooden floorboard, only an inch of dead tree between Harry James Potter and Lord Voldemort himself… Severus Snape begged, but his pleas fell on deaf ears…</p>\n      <p>'<em>I regret it.'</em></p>\n      <p>He didn't.</p>\n      <p>Snape's memories were siphoned into a glass chalice, and Hermione Granger was offering them up into the Chosen One's hands—</p>\n      <p>\n        <em>No—</em>\n      </p>\n      <p>\n        <em>Yes.</em>\n      </p>\n      <p>Harry's memories dissolved into Severus Snape's memories, and the rabbit hole of the past became amplified, plunging in its duality.</p>\n      <p>Severus and Lily. Severus and Lily. Severus and Lily. Unrequited love that told the tale of a traitor in Lord Voldemort's midst.</p>\n      <p>Severus Snape…had managed the impossible task of deceiving the Dark Lord…</p>\n      <p>Harry snapped his eyes shut, using every inch of resistance that he had left in his tired, aching body. He reached for his wand, fumbling through his robes with desperate hands that trembled&nbsp;like a child who was freezing to death.</p>\n      <p>Lord Voldemort reacted so quickly it was inhuman. One second, he was a distorted white phantom on the other side of the fire, the next, he was there, <em>right there</em>, a mere inch in front of Harry's shaking form. A pale hand snatched at his face like a viper, sharp nails sinking into the skin of his cheeks and forcing his jaw up so that when Harry's eyes instinctively flew open, they were met with a searing, crimson gaze, so close, frighteningly close.</p>\n      <p>\"<em>Show me.\"</em></p>\n      <p>There was nothing he could do.&nbsp;Harry couldn't even scream as the Dark Lord once more ripped open his unwilling mind.</p>\n      <p>…The ghost-like memory of Albus Dumbledore proclaimed his damnation to a horrified Severus Snape…and it was over.</p>\n      <p>\n        <em>Horcrux.</em>\n      </p>\n      <p>Harry was wrenched back into reality. Voldemort kept ahold of his face, staring with piercing eyes into the depth of Harrys' own. Not hostile. Not murderous, not angry.</p>\n      <p>Analytical. Intellectual and searching, despite their stillness.</p>\n      <p>The silence was suffocating in every conceivable way. Harry could barely draw breath as the Dark Lord held him there, frozen by red eyes and snow white fingers wrapped around his jaw.</p>\n      <p>\"…Kill me.\"</p>\n      <p>Harry finally choked the words out in a raspy voice. A plea. A desperate request for the Dark Lord to do what he'd always wanted to do, what he'd been trying to do for as long as Harry Potter had been the object of a meaningless prophecy.</p>\n      <p>For a time, the Dark Lord did not react. He merely continued to stare at the Boy Who Lived with that detached demeanor.</p>\n      <p>Then he smiled.</p>\n      <p>A small, crooked grin that made the already inhuman face of Lord Voldemort appear altogether demonic. He chuckled so softly that Harry was sure no one else but he could hear it. The soft air from his laughter was inexplicably chilly as it brushed against Harry's lips, sending shivers down his already shaking spine.</p>\n      <p>Voldemort's breath smelled like ice and blood.</p>\n      <p>The Dark Lord didn't move at all when he finally did speak. He kept Harry's eyes locked under his, pinned down with little more than a stare. His next words, spoken loudly enough for all of his followers to hear, would be the declaration that ripped Harry Potter's world to shreds.</p>\n      <p>\"A change of plans.\"</p>\n    </div>\n  </div>\n</div>\n  </div>"
},{
  "_id": {
    "$oid": "6367d3d3c0e982553720c477"
  },
  "title": "The Diary, A Promise, and a Lie",
  "content": "<div class=\"userstuff module\" role=\"article\">\n    <h3 class=\"landmark heading\" id=\"work\">Chapter Text</h3>\n    <p>It was something so simple. Something so unassuming, so innocent seeming. It was just a book after all, and what harm could ever come from a book?</p><p>Of course, harm could come from a book, in the form of tears spared at the death of a beloved character, sleepless nights spent hunched over a novel with only a dim, singular light for comfort. But it was never real harm, nothing that followed you when you closed the book and set it back on your shelf, ready to continue about your day. </p><p>But this book...</p><p>It was different.</p><p>It was dangerous.</p><p>It hummed with energy, with magic that Harry did not know- he was not familiar with it but knew without knowing how he did that it was dark. Terribly dark. And he could feel it pulse out to him in waves, feel his stomach twist and a dull ache settle behind his right eye as fingertips grazed over the leather bound journal. It was soft, the leather worn and pages yellow but it was in well enough condition. At the very bottom of it, embossed in golden lettering was the name T.M. Riddle. </p><p>He did not know who that was, or why Lucius Malfoy had had it in his possession and felt it appropriate to drop it within Ginny's cauldron. But Harry had not trusted it in the slightest, fingers plucking it from her small collection of texts when she wasn't looking and hiding it in his own, promising to investigate it further, when it was later in the evening.</p><p>And it was later- several evenings later to be exact, and he sat on his bed in the Gryffindor dormitories, the thick, crimson curtains drawn and the journal settled in his lap. An index finger traced over the printed letters, the sharp turns of the T and the M, the rounded bellies of the R and the D's. It was as if a syringe had been placed to the tip of his finger, injecting something into his veins that made his arm itch and burn as it coursed through him- venom, acid, or something euphoric. </p><p>He opened it, the heel of his palm smoothing down the center of it to flatten it and keep it splayed open. The pages smelt crisp, ancient, like dust and the less frequented corner of a library. He reached for his quill, unscrewing a bottle of ink and settling it on his knee, dipping the brass tip of the quill into the black well. He brought it to the right hand page, hesitating for a moment as he chewed his lip.</p><p>What had he intended to do, exactly?</p><p>If Malfoy had slipped the diary to Ginny, it had to be for a purpose. And what purpose was it? What was it capable of? It was just a book. A blank one at that. </p><p>A bead of ink fell from the quill, landing on the page and splattering against it, specks of black dotted randomly throughout. It glinted, the gloss drying down rather quickly, when a curious thing happened. Of course, many a curious thing happened in Harry's life, ever since his eleventh birthday, beginning with a flurry of letters with red stamps raining from the sky. Though curiosity was commonplace long before then, if he was being honest. Snakes slipping from once enclosed cages, hair regrowing overnight. </p><p>But this was curious in particular in that the ink seemed to disappear into the paper- saturating the yellow pages until there was nothing left but blank space. And surely that was odd, even in the magical world. After all, what was the purpose of a blank book if all writing on it vanished?</p><p>Before he could ponder the thought any further, words appeared before him, curling, elegant script.</p><p>Hello?</p><p>-xXx-</p><p>Tom Marvolo Riddle was who the journal had belonged to, and there was something about the name that did not quite settle in Harry's mouth. It was metal on his tongue, it was a twinge behind his eye. He did not know why a man existed within the slightly too stiff pages, and he had thought to ask Hermione of it but decided against it. She was oddly suspicious of things, and surely a diary that wrote back to him would be cause enough for her to alert McGonagall. Dumbledore even.</p><p>And there was no sense in bothering the headmaster with something so silly. It was just a book.</p><p>'I was trapped in the pages of this diary long ago,' Tom had explained at Harry's prompting. 'The effects of a spell I used that had not gone as planned.'</p><p>'But what is it like in there? How can someone exist in a diary?' Harry asked, his own words looking sloppy, hasty against the fading calligraphy. But they disappeared soon enough, replaced with Tom's own answer.</p><p>'I am left with nothing but memories. Empty rooms and empty halls from my life before I was locked within this book.'</p><p>Harry frowned at that. That sounded awful! He couldn't imagine what that might be like- spending eternity with nothing but the paths he once walked, rooms he had familiarized himself with enough to recall them in imprisonment. No Ron or Hermione, no Hedwig or Hagrid. Nothing at all except his own meager supply of memories. Worse than that, what if it wasn't even Hogwarts at all laid out before him? What if he was trapped within the home on Privet Drive, stuck within the suffocating walls of his cupboard beneath the stairs, not even the spiders for company?</p><p>'What spell did you use? Maybe there's a way to undo it.' After a moment, he added, 'I can ask Dumbledore. He might know.'</p><p>The words came back faster, a bit spikier this time as if Tom was rushed. 'No, it was a spell of my own creation, and as such, it is impossible for anyone but myself to undo. I am just happy to have someone to talk to. Tell me about yourself, Harry.'</p><p>Harry blinked owlishly, a hand reaching up to slide the glasses back up his nose. No one had ever really asked him to talk about himself. Either no one cared, believing he was the disturbed delinquent nephew of Vernon and Petunia Dursley, and as such, nothing he had to say was of any worth, or they already knew everything there was to know about Harry Potter. More than even he knew of himself. </p><p>He didn't even know where to begin, exactly. His family, or rather, lack there of? Or perhaps that was too personal, too intimate to share with a book. School? Tom was a wizard himself- or had been- and surely they would have something of common ground? A favorite subject shared between them, complaints about particularly challenging studies? </p><p>A question from Tom settled the discourse for him. 'You said you're a Potter? Any relation to Fleamont Potter?'</p><p>Harry shifted in his bed, spine straightening in interest. Fleamont Potter? The name bore no meaning to him- the only Potter he knew was his father, James- but Tom seemed to know. Had he known his family from his own time? Wasting no time, he scrawled back, 'I'm not sure. My parents died when I was young, and I was raised by my aunt and uncle who were muggles. My father was James Potter. Did you know him?'</p><p>'I'm afraid not, and I'm sorry for your loss. I don't have parents either.'</p><p>And even as he was filled with disappointment at having nothing more of his parents than some photographs, he was filled with something else. Something thrilling. It was strange, Harry thought, the source of comfort that came from shared tragedy. The way your shoulders slumped, you exhaled deeply, when you learned you were not alone in this world. That others knew your pain, the absence that came with having no proper family to speak of. And perhaps it was rude, but in his excitement- the longing reach to a kindred spirit- he glossed over Tom's own admission of loss, adding, 'My parents were killed by a dark wizard. You probably don't know him, I don't think he was around in your time. Lord Voldemort- have you heard of him?'</p><p>His heartbeat pulsed out of rhythm. </p><p>A snore disrupted the silence. </p><p>He worried if he had offended Tom, if he should have offered comfort as well instead of losing himself in the desire to share with a fellow orphan- someone who knew what it meant to have no mother to tuck you in, no father to ruffle your hair.</p><p>He brought his quill to the page, ready to right an apology, when Tom wrote back. 'No, I haven't. Dark wizard you say? How terrible. I could never imagine something so awful. Would you like to talk about it?'</p><p>-xXx-</p><p>Harry decided he liked speaking with Tom. He was smart and kind, and he seemed to understand Harry in a way that Ron or Hermione could not. He was an orphan as well, raised in the muggle world until he was eleven and learned of his true identity, that there was an entire world hidden below him. A delightful world, vibrant and technicolor, full of life and energy and wonder and literal magic. The muggle world was not like that. The muggle world was grim, dull. Monochromatic, several shades of gray and beige and nothing more. </p><p>He carried the journal with him, bending the front cover backwards so as to keep it small and hidden on his lap, and he wondered how Hermione might admonish him if she saw him treat a book in such a way. But she never noticed him scribbling away, he never intended to tell her. </p><p>Tom would help him in his studies, explaining things that had not made sense in class and putting them into words that he could grasp onto, fingers curling triumphantly around the concepts. But he never supplied the answers, instead forcing Harry to come to the conclusion on his own. </p><p>'You'll get nowhere if I just tell you what to do. You need to understand it yourself. You could be a great wizard, and it would be a shame to waste it all because it was easier to tell than to teach,' he would explain, making Harry blush at the praise. Everyone assured him he was a great wizard- he had to be after all, he defeated Lord Voldemort when he was only a baby. But the words seemed genuine coming from Tom- he was not handing him praise, cooing him with it. He was simply holding them above him, like a goal to be reached. </p><p>Because Harry wasn't a great wizard, really. He was lucky. He had survived a terrible thing; a terrible thing that had claimed the lives of many an actual great witch or wizard before him. That was all. He had no memory of the event that earned him the taunting moniker, and he was not the smartest boy in his class. Far from it. He was decent on a broom, but that was hardly the marker of someone great. </p><p>Tom had to have been a great wizard when he was alive. Perhaps he still was alive, though. Not quite dead, not quite living. Caught on some unfathomable plane in between, trapped in something flat and two dimensional. </p><p>There wasn't a subject that Tom did not seem to know of. There wasn't a spell that he couldn't do, a potion he couldn't make. Harry was in awe of his brilliance, really, and he thought it quite a shame that someone with so much potential- someone who could have done some truly remarkable things for the world- had been removed from it. He had considered bringing the journal to Dumbledore once more, in an attempt to free him from the confines of it. But Tom assured him it would be useless.</p><p>'Besides,' Tom wrote, in his looping and neat script, 'I think I may have found a way to reverse the spell. But I will need your help, Harry. Can you promise me you'll help?'</p><p>-xXx-</p><p>Of course Harry agreed to help Tom, the words scribbled earnestly back before he had even realized he was writing. Though Tom wouldn't need his help right away, he was still researching his options, he had explained. And so they continued to speak, of nothing and everything and all the things in between.</p><p>There was a pleasant hum surrounding him, muffling the world and reality away as Harry sat with the journal propped on his thighs, back against the rough textured tree. His head felt heavy, but not in weighted, dreadful way. Like the sort of heaviness that befalls you right as your about to sleep after a particularly exhausting day, reality distorting into the nonsensical worlds of dreams. </p><p>His dreams had been a tad funny, as well. Blurs of things not remembered, things that could not have possibly existed in his own mind. Of a stern faced and frightened woman, of tides crashing against jagged rocks of a deep and dark cavern. </p><p>But dreams were always funny, and he thought nothing of it. Sometimes he even shared the dreams with Tom.</p><p>'I was in a cave and a bunch of snakes slithered out from the rocks and crevices, winding around rib cages and other bones. But they weren't scary, they just wanted a chat. It was sort of funny. I think they were lonely.'</p><p>'Snakes can get lonely, too.'</p><p>'I know. I met one once, at the zoo with my cousin. He told me he was lonely, and I let him out. My cousin fell into the enclosure-'</p><p>Tom wrote back before Harry could even finish the story. 'This was a dream?'</p><p>'No, it wasn't.'</p><p>-xXx-</p><p>'Tell me about the night your parents died, Harry,' Tom wrote, and Harry settled back against the propped up pillows of his bed, skewing his lips in thought. He had never told Tom everything about that night, only that he had been young and both his mother and father were killed by the dark wizard. Some called him You-Know-Who. Others He-Who-Must-Not-Be-Named. Harry told him he thought such names were ridiculous, that he was just a wizard- not a monster or a boogeyman. Tom had told him that it was possible for those things to be synonymous, that sometimes the most terrifying monsters are the men and women you pass on the streets. </p><p>But that was it. He had not told him that he himself was meant to die. That he had a terrible scar on the right side of his head; like he was porcelain doll, dropped once and fractured with little white fissures cracked permanently into him. He had liked that Tom didn't treat him like a celebrity, a pariah. He liked that he spoke with him because he wanted to, not simply because he had become a modern day myth and he wanted the opportunity to speak with the great Harry Potter.</p><p>But they were friends, he supposed. Tentative friends- as much as someone could be a friend with someone when they existed as nothing more than vanishing black text against yellowed paper. It was November now, and they had been speaking for a little more than two months- surely if now was not the time to divulge such secrets, there would never come a time.</p><p>And so he shared it with him, a dissonant and perturbing whistling sound filling his head all the while, itching at the back of his brain. He told him how Voldemort had supposedly died that night, that his own curse had rebounded off Harry and struck him. That his parents were dead, and he had nothing to show for it except a distinct scar. That his aunt and uncle reviled him, that he had been made to sleep within a cupboard for most of his young life, having nightmares within the small space of bright, green flashes of light, a woman screaming his name, and motorcycles flying through the air. He was a hero in the Wizarding World, but 'the boy' in his own muggle home. That he thought it very funny when he freed the large snake and trapped Dudley inside the enclosure. </p><p>Tom did not respond for quite some time, and Harry chewed his lips, worried that he had done something wrong. The whistling was growing louder, and he palmed his ear, pressing it tight against it and releasing it in the hopes that the pressure might stop the sound. But it did not, and it continued to ring achingly against his skull.</p><p>When Tom wrote back, his words were curt. Short and too the point, and Harry wondered if he had upset him. For some reason, the thought of such a thing was devastating. He did not want to upset Tom.</p><p>'Harry, I'm sorry to leave like this, but I think I need to do some more research.'</p><p>He did not write back for about two weeks.</p><p>-xXx-</p><p>Harry knew Tom had finally written him, though he did not know how he did. It was as if it were a premonition, a tingling within his brain that let him know that there would be words inscribed for him when he opened the journal. And perhaps it was because it had been so long since he spoke with the wizard, perhaps it was because he was growing more and more agitated as the week progressed, snapping out for the smallest slight against him. Perhaps it was all the reasons, or none of them, but he excused himself from class- feigning an illness and threatening to vomit everywhere should he not be allowed to head to the infirmary- and ducked within the nearest empty classroom, opening the diary eagerly with his back pressed against the door.</p><p>'Terribly sorry for my absence, Harry. I hope you are doing well. But I've made great strides in my research.'</p><p>Harry fumbled in his bag for a quill and bottled ink, fingers trembling as he assembled them and put the brass tip against paper. 'That's good. Do you still need my help?' He wanted to help Tom, needed to, he felt. Something ached within his chest, his heart pulsed erratically and harsh against his sternum. It was strange, and had he not felt so clouded, so ill to begin with, he might have sought out help, realized that he was not well, not in the slightest.</p><p>'Yes, in time. Until then, I'd like to meet you, Harry. Would you like to meet me?'</p><p>Harry licked his lips, blinked once, twice at the words. Of course he would. He had been corresponding with him for what felt like years, finding him as easy to talk to as if he was a long ago friend, forgotten by nothing more than time and distance. But it was impossible. Least, impossible until Tom could put his research to good use. </p><p>When he did not write back promptly enough, Tom added, 'It won't hurt, and you'll be back before you're missed.'</p><p>He narrowed his eyes at that, frowning at the vague, enigmatic words. What did he mean? Before he could ponder it any further, the words begin to glow, shifting in color from black to glittering gold, the diary vibrating in his hands and becoming hot to the touch. He dropped it to the ground, shuffling to his feet. He thought to run away from it, that perhaps it wasn't a simple book after all, but there was a pull from behind his navel, a great tug and it was if he had jumped into a lake, the water warm from the sun and seeping into him. Dragging him further and further into its void.</p><p>The sensation dimmed, his feet once more landing on solid ground, and he lifted his head to find that he had been transported. </p><p>Where was once an empty classroom, desks and chairs neatly pushed aside, was now the library. Or rather, a version of the library. It was nebulous and gray, dull. Like he was viewing it from behind a thick black veil, the gossamer fabric distorting the shelves and books and making them appear nothing more than the phantom traces of a forgotten memory. </p><p>It was empty, a terribly disconcerting thing since it had been well into the day and the library should have been full of studying students, heads bowed over parchment and tomes. There was something awful about places that should have been full with life, suddenly absent of it.</p><p>“Harry?”</p><p>He twisted around at the voice, hands sinking into pockets, patting around the fabric in an attempt to find his wand. It wasn't there, and something sunk into the pit of his belly, heavy and weighted. Where was his wand? He had had it when he left the classroom!</p><p>“You can't do magic here, you needn't have a wand,” the voice spoke again, softly and sympathetic sounded, legs of a chair screeching across marble floors. Harry looked up, blinking at the sight of a wizard- only a few years older than himself, but much taller. He was impossibly sharp and clear against the distorted library, a very real, concise thing against a world of nothingness. </p><p>It was Tom Riddle, and he was incredibly handsome, with dark, luxurious hair that was combed neatly in place, a swooping curl over his brow. His face was angular, with sharp and high cheekbones that cast shadows over the hollows of his cheeks. Everything about him was perfect, like marble statues he had only seen in pictures, depictions of Roman Gods with slim noses and sinewy muscles. </p><p>He felt much smaller in his presence, diminutive in every sense of the word as Tom practically towered over him, gazing at him with a curious, intense look in his dark blue eyes. It made him swallow, made the incessant ringing in his ear grow thrice as loud. It was not an unkind look, the exact opposite really, but it was the sort of look one had when they knew something that they weren't quite ready to divulge.</p><p>“Tom? How...” Harry choked out, brows furrowing as he glanced about him, at the insubstantial bookshelves. He might have been relatively new to the magical world, but he was certain that books weren't supposed to consume you.</p><p>They weren't really supposed to talk back either, but he shoved the thought away. His head was beginning to ache, the twinge behind his right eye turning into a sharp pain.</p><p>“Don't worry, you'll not be here for long,” Tom assured him in a quiet, placating tone as he reached outward. Fingers brushed over Harry's forehead, pushing aside the hair to reveal the jagged lines of his scar, like the traces of a lightning bolt sinking into the soft earth. He shifted under the appraisal, tipping his head back so that the hand fell away and his dark hair was left to stick up in an awkward angle. He patted it down. </p><p>“That doesn't explain how you got me in here,” he asserted, something within his stomach coiling intensely. Perhaps he had made a terrible mistake, trusting Tom. He should have marched to Dumbledore's office the moment the thought first crept into his head, should have sought out the help of someone much wiser. What if he never got out? What if he was trapped here for eternity, stuck within the nonexistent world that quivered in and out of focus, as if someone had wiped a dirty rag over it all?</p><p>A hand settled on his shoulder, and his chin whipped upward to meet Tom's soft, friendly gaze, his lips raised in a small smile. “Harry, relax. It's just magic is all. Surely, this isn't the strangest thing to happen to you?”</p><p>No, honestly, it really wasn't. He hardly even knew what was considered odd in the magical world, so skewed was the absurdity of it all. People lived within the pages of books, the brushstrokes of paint, and who was he to know which of it was meant to be that way?</p><p>Harry chewed his lip. “So, I'm not trapped here, then?”</p><p>Tom frowned. “No, just me. You can come and go as you please.”</p><p>He swallowed, thickly, like he had something lodged within his throat. “I'd like to go, then,” he asked. It wasn't out of fear- in fact, he hardly felt any fear at all. He was terribly intrigued by it all, and what he really wanted to was lob questions at Tom, to speak with the man- properly speak- about anything and everything, from the subjects they had discussed prior to all the ones left untouched. </p><p>He wasn't afraid, he just wanted to leave to make sure that he could. </p><p>He thought he saw Tom's jaw clench, his eyes flash from blue to something else entirely, something dark, but it must have been a trick of the light. Or perhaps he had blinked, distorting the image of Tom before him, because he looked just as pleasant and kind as he had from the few minutes he stood before him in the library. Tom nodded his head, smiling as he waved a hand through the air. “Well then, until next time, Harry.”</p><p>Something pulled behind his navel.</p><p>He was submerged in water once more.</p><p>And within seconds, he was back in the empty classroom, blinking at the edges of his world which suddenly seemed too sharp, too clean. The colors too bright and saturated.</p><p>The journal was on the floor before him, Tom's final words to him disappearing.</p><p>'Until next time, Harry.'</p><p>-xXx-</p><p>“Do you think it's possible to be drawn into a book?” Harry asked, attempting to sound casual about the question, fingers thrumming over the table. He had not written back to Tom since he had been consumed and then spat out by the diary, though his heart always seemed to skip a beat whenever Tom attempted to reach out to him, his veins and capillaries pulsing with the sensation as ink sank into paper.</p><p>Hermione huffed. “Is that a joke? Of course you can get drawn into a book, why do you think people read in the-”</p><p>“No, I mean literally. Like the book sucks you in?”</p><p>She looked at him, her eyes narrowed, lips pursed. “No, absolutely not. Why would you ask such a thing?”</p><p>He felt that he should tell her. That he should tell somebody. But the words died on his lips, his tongue unable to meet the roof of his mouth, press against his teeth to make the sounds that became syllables which became words. He needed to tell someone, but he needed to protect Tom more. </p><p>He shrugged. “No reason.”</p><p>-xXx-</p><p>His face was hot, fevered, and he could taste blood, tinny and vinegar in his mouth, from where his teeth dug too deeply into the soft flesh of his cheeks. Fingers curled into his palm, nails digging into skin, and his hands shook, knuckles turning white. </p><p>It wasn't fair. He had been trying to help Justin. Why on earth would he tell a snake to attack him? He was telling the snake to stop. To leave him alone. But of course, no one listened to him, rumors spreading around the school faster than a fiendfyre, talking of how Harry Potter was a parselmouth. That Harry Potter was surely not to be trusted. After all, no good or respectable witch or wizard spoke to snakes.</p><p>It wasn't fair. </p><p>Even Ron had looked at him with uncertainty, as if seeing him for the first time. He hated it all, the way the familiar and kind eyes had become that of a stranger, and just like that his veins were hot, his skin prickled. He turned away from them, walking fast in the opposite direction, ignoring their pleas to him, begging him to just stop so they could talk.</p><p>But he didn't want to talk.</p><p>Not to them at least.</p><p>-xXx-</p><p>When he arrived in the journal, it was not into the library, but instead outside, to the tree beside the lake that he, Hermione and Ron often sat under when the weather was favorable. It was just as distorted as the library had been, the greens not quite green enough, and the blue of the sky was instead a murky gray, a mirror reflection of the lake below. </p><p>Tom was sitting under the tree, inclining his head only slightly when Harry traipsed until he stood just before him. </p><p>“Hello again, Harry,” he said without looking up from the book in his lap, long fingers turning a page over. “I've missed our talks. I thought I might not see you again.”</p><p>He blinked, shrugging his shoulders as a blush crept up from the collar of his shirt. It was always a surprise when someone actually missed him, that someone might enjoy him and his presence. He sat down beside the older wizard, crossing his legs.</p><p>“They found out I can speak to snakes,” he said after a moment, reaching down to pluck at a blade of grass, more brown than green, as though it were dead. “They weren't impressed,” he added, laughter bubbling from his throat and then dying almost immediately.</p><p>Tom hummed. “No, they rarely ever are. But they were frightened I'm sure, and isn't that just as good?” </p><p>He wasn't sure if Tom was joking, but he smiled all the same.</p><p>-xXx-</p><p>Months passed, a blur of golden leaves, fat, fluffy crystals of snow, and heavy droplets of rain that splattered against the ground, left Harry's glasses a fog. The diary sat snug in the inner pocket of his robe, where it always did, beside a spare quill and some ink just in case he needed it in a pinch. He spoke with Tom more than he did anyone else, either visiting him in his empty castle, or scratching quill against paper. It had become a need, and a ball of tightly wound wire would settle in his chest if he did not have the journal with him, the wire unwinding and coiling around him if he did not feel the indent of the diary against his chest.</p><p>He needed Tom almost as much as he needed oxygen to breathe. It was something he had not felt about anyone else, and he thought it strange, foreign. One day when he was feeling particularly brave, he mentioned this to Tom, writing it down in the middle of class when Professor Binns was drawling on about something uninteresting.</p><p>Tom's response was smug, and he could imagine his full lips curving into a smirk. 'Good.'</p><p>-xXx-</p><p>'Have the rumors of you being a dark wizard in disguise settled down at all?' </p><p>Harry snorted derisively at that, shaking his head as he wrote back. 'No, I've been blacklisted. Might as well join You-Know-Who and live the life they all seem to want of me so badly.'</p><p>Tom wrote back after a moment. 'Always good to keep your options open.'</p><p>Harry frowned. 'I was kidding, of course.'</p><p>'I know.'</p><p>-xXx-</p><p>Harry was freezing. It was the first thing he knew. Consciousness came to him slowly, dizzily. He felt airy, light, as if whatever was weighing him down was gone. He blinked. Wrapped his arms around his chest.</p><p>He was outside, bare feet sinking into damp earth, the sky navy, purple at the horizon, a soft pink and orange glow seeping into the palette of colors. He was shivering, nothing but a plain t-shirt and flannel pajamas bottom. Hardly enough to keep out the chill of spring, crystals of frost iced over every individual blade of grass.</p><p>How had he gotten out here? Had he been sleepwalking?</p><p>He flushed, embarrassed to have done something so...well, weird. It was bad enough he had become the kid who talked to snakes, he certainly did not need to be the kid who sleepwalked as well.</p><p>It took great doing, and he had to duck behind several statues to avoid being caught, but he was able to make it to Gryffindor tower unnoticed. He slipped into his bed, but he was unable to sleep, too wired, his brain too alive with thought and activity. He reached beneath his pillow, pulled out the slim journal.</p><p>-xXx-</p><p>Harry awoke from his sleep with a start, sputtering and coughing, hands clutched tightly onto the curtain as he attempted to pull it apart. He was covered in a thick sheen of sweat, his heart palpitated wildly, as if it might burst through his ribs and his skin at any moment. His head spun on his shoulders, bright, white lights prickling into his vision, and his foot caught on his blanket, causing him to fall to the floor.</p><p>He groaned, entangled in the sheets and the blankets and his drenched nightshirt which clung to his skin, and he turned on his side, vomiting.</p><p>Lights flicked on.</p><p>Feet padded around him.</p><p>Hands tugged at him.</p><p>But he could not respond to their questions, could not hear them over the loud, ringing sound in his head. His eyes remained closed, too heavy to lift.</p><p>He had had a terrible nightmare.</p><p>Of blinding green lights, dead white rabbits, and a giant snake with fangs the size of his forearm. </p><p>-xXx-</p><p>“Harry,” Dumbledore asked, his voice low and soft and warm, filled with concern and it made Harry twist his head to the side, burying his face in the white pillow slip of his bed at the hospital wing. He had no memory of how he came to be here, no memory of the what had occurred several hours prior to it as well. There was a chunk of time and thought missing from his recollection- having fallen asleep at precisely 10:02 the night before, and was found wandering the halls at exactly 4:28 by Peeves, who made such a commotion that Filch came to see the cause of it all. What he found instead was an unconscious Harry Potter, and the poltergeist claiming that he hadn't done a thing- that Harry had just collapsed all on his own.</p><p>“You can tell me why you were outside your dormitory, you know that, Harry? You won't be in trouble, I'm just worried and we need to make sure you're alright,” the elderly wizard said, blue eyes gazing at him over half-moon spectacles. After a moment, he added, “Mr. Weasley and Miss Granger have informed me that you've not been feeling well. That you've been having nightmares, have been very irritable lately.”</p><p>He wished he could tell the Headmaster why he was out in the halls- he really did- but he couldn't. Because he genuinely didn't know and if he had meant to wander the halls wouldn't he have the forethought to bring his invisibility cloak with him? But he couldn't very well say that, insisting instead that he must have been sleep walking. </p><p>Dumbledore frowned. “Is there something you wish to tell me, Harry? Anything at all.”</p><p>Harry shook his head, the motion dizzying him. “No sir, nothing at all.” The words sounded cold even to him, foreign on his lips as if they were not his own. Dumbledore sighed.</p><p>“Very well.”</p><p>-xXx-</p><p>Tom's fingers threaded through Harry's locks, smoothing the hair back as his head laid in the older boy's lap. His eyes were closed, and he was enjoying the peace of the world. It might have been a prison for Tom, but it had become a solace for him. There was no Hermione with her worried, furtive glances, no Ron with his clunky jokes. No Dumbledore gazing at him in a way that made him shift uncomfortably in his seat, no students whispering behind hands about him.</p><p>But more importantly, there were no chunks of time left unaccounted for, no blank spaces between one moment and another. When he was in the diary, the quell of his stomach settled, the ringing in his head began to get quieter, and it was as if he ceased to exist. A nothingness surrounded by nothingness. </p><p>It was simply him and Tom in the crude facsimile of Hogwarts. And it was enough.</p><p>“I feel sick all the time,” Harry muttered. “And no one will leave me alone about it. I get so angry, I just want to scream. I snapped at Ron for no reason the other day. Well, okay, he was chewing with his mouth open which is not only rude but just disgusting and the sound was grating on my nerves and I just-”</p><p>A hand settled down on his chest, pressing down lightly. “Harry, I think I've perfected the reversal spell,” Tom said.</p><p>Harry lurched forward, elbows pushing him upward from the soft ground and raising to his knees. He twisted to face Tom, his lips curling into a wide grin. “Really?”</p><p>He nodded, leaning his head against the tree. “Yes. You're still willing to help me?”</p><p>“Of course. What do you need me to do?”</p><p>Tom smiled. “Don't worry. You'll know.”</p><p>-xXx-</p><p>There was blood on his hands. Not in the figurative sense of the term, where he had just done something very bad and was caught. But in the literal sense. His hands trembled, sticky and warm from the viscus fluid, looking almost black in the low light of the lavatory. Beads of it slipped down the curve of his hand, down his wrist. </p><p>He had blacked out again. He had no idea of why he was here, how he had gotten here, or why there was blood. Not just on his hands. His shoes were stained with it as well, the hem of his cloak saturated and heavy and there was so much of it and he didn't think it was his but then whose was it?</p><p>He couldn't breathe, his chest was constricted and would not expand, his throat was swollen and searing from the strain of not breathing or not breathing enough. Panic racketed through him, made his body convulse, his stomach twitch. Slowly he pulled himself up from the floor of the bathroom- how had he gotten here?- and turned to the sink, not knowing of what to do but knowing that washing off the blood was as good a start as any. </p><p>The water ran red, swirling around the drain until it varied in shades, from deep crimson to pink. His hands sat underneath the faucet, wispy strands of steam rising above him as his skin burned at the too hot water. But it never ran clear. The water remained at least pink, and his hands were stained, the pigment deep within valleys of his skin, the lines of his individual fingerprint dyed deeper than the rest of him.</p><p>It wouldn't come off, not fully.</p><p>When he could bear the pain no more, he pulled his hands against him, cradling them to his chest and bunching them in the fabric of his cloak to dry. </p><p>He needed to speak with someone. Someone he could trust. Someone who might tell him what to do. What he had done.</p><p>What did he do?</p><p>He found the diary, slipped within the pocket of his robes, beside a near empty bottle of ink and a small quill with a bent tip. His hands shook as he opened the ink, having to try four times to get it as each time his hand slipped from the lid, and he propped the diary on the lip of the sink. His writing spiked, curved with his shivering.</p><p>'Tom? Are you there?'</p><p>He waited, his head shaking when the words didn't disappear, when they remained etched on the page, the glossy black ink drying and not once sinking deeper-</p><p>He ripped the page from the journal, crumpling it in his fist before bringing the quill to a new, separate page. He wrote again, the words even messier than before. 'Tom?'</p><p>They remained, a taunt, a contrast between the dull yellow pages and the sharp ink. The did not disappear, and he wrote again, pressing the quill too hard into the page that it ripped through, left an impression on the pages behind it.</p><p>'Tom, please, I need you.'</p><p>Nothing. No response. No vanishing words.</p><p>Tom was gone.</p><p>-xXx-</p><p>Everyone was still asleep by the time he made it back to the dormitories, and he sat on his bed, hands tangled in his hair as he tried to even his breathing. As he tried to make sense of the events that alluded him. The diary sat before him, several pages ripped from its binding so that he could see frayed white thread that ran down the center of it. It was just an ordinary book now, nothing special about it. The engraved name on the front cover had disappeared, not even an impression of what once existed.</p><p>Had he imagined it all then? Had it all been a hallucination, a series of dreams that cropped up throughout the entirety of his school year? Had it been a- what was it called? Psychotic break? Had he lost his mind? </p><p>He did not know, and that was the most terrifying thing of all. He was not certain of anything anymore- had Tom Riddle even existed? Was he a real person at any point in time? And whose blood had he cleaned off his shoes? </p><p>His chest burned with his panicked, frightened sobs, oxygen searing his lungs. Hands shook as they gripped onto his hair, as his glasses fell from his nose. He couldn't breathe, he couldn't think. All he could hear was his blood in his head, like waves of an ocean were crashing over top him, like he was drowning, the undercurrent of the ocean pulling the sand away from where he stood.</p><p>He fell asleep after his eyes burned, no more tears to shed, his cheek tacky and salty. The blanket was twisted over his head, and he hoped that when he awoke it would be to learn that this had all been one elaborate nightmare.</p><p>-xXx-</p><p>The curtains surrounding his bed were pulled open, and Harry sat up, his pink hands diving to wind in his comforter. Ron stood at the part of his curtains, white hands holding them in place, his eyes wide and wet with tears. Light streamed in from the window, warm and golden. It was well into the morning.</p><p>“Ron?” Harry asked, his voice hoarse from the night before, from his inability to breathe and his constant tears and the amount of times he hunched over a toilet in the lavatory, emptying his stomach until nothing but dark green and black slime rose from his throat. </p><p>His lip trembled. “Ginny-” was all he managed to whisper before his face crumpled, his knees giving out before him.</p><p>Something flashed within Harry's mind, the glimpse of something forgotten. Of red hair and blood- so much blood. Dark blue eyes and a diary with pages so soaked in blood that they clumped together, curled and warped. </p><p>Ginny was dead. He didn't know how he knew this, he just did.</p><p>He knew that she was dead, that Tom Riddle was gone, and that his hands were still stained with blood.</p><p>What had he done?</p><p>-xXx-</p><p>Harry sat on the bench at Gryffindor table, a somber silence settled over the whole Great Hall. Trunks sat behind each student, heads bowed in whispers, in gossip. Some wondered why they were being urged to leave so early, what had happened to summon so many Ministry officials. But the Gryffindor table was the most silent of all, seeming too empty with the absence of the Weasleys, every one them gone, yet their presence weighing down heavy on them. There were even gaps between the students that they might have sat beside, Hermione sitting opposite Harry, no one to her left, no one to his right. Just an empty space where once presided Ginny, Ron. Lee Jordan and Katie Bell were separated by the space of two Weasley twins, no one daring to pass the divide. An unspoken rule. </p><p>“I wonder when Hogwarts will reopen,” Hermione muttered, to no one in particular. </p><p>Harry had not spoken, not a word since he left Dumbledore's office, the conversation echoing around in his head on repeat, an unending stream of words and letters that ran into each other.</p><p>'How long will Hogwarts be closed for, Professor?' Harry had asked quietly, knowing that perhaps it was a selfish question. A selfish concern. Someone had died. His best friend's younger sister was cold and pale and dead somewhere and he was wondering when he might return to school. </p><p>'Until the cause of her death is determined and it is no longer considered a threat,' he answered, his blue eyes dull, void of all mirth. He seemed much older all of a sudden. He should have told him. He should have told him about the diary and Tom Riddle and of the hands which were still pink in his pockets. But he couldn't. He wouldn't be believed, there wasn't any proof of it. He wasn't even sure if he believed himself. </p><p>'This isn't the first time a student has passed away, I'm afraid,' Dumbledore spoke, and Harry lifted his head, wondering if he knew he was talking aloud. If he meant to share this information. But he still continued to speak, his eyes not quite meeting Harry's as he added, 'We almost closed then, too. But the creature who caused it was believed to have been found. By a former student of the time, a Mr. Tom Riddle.'</p><p>His spine straightened, his jaw clenched. 'Believed?' he asked, licking his lips. 'Tom Riddle?'</p><p>Dumbledore lifted his chin, gazing at Harry with an indiscernible expression. 'Yes. He was lauded as a hero, even awarded for his services to the school. But that was a long time ago. Things have changed since then.'</p><p>'How so?'</p><p>'Tom Riddle is better known as Lord Voldemort these days.'</p><p>Tom Riddle was Lord Voldemort. Ginny Weasley was dead. And Harry Potter had blood on his hands.</p><p>-xXx-</p><p>Dumbledore sighed heavily, placing his glasses on the desk beside him so as to rub his eyes with long, bony fingers. The Weasleys had left his office only moments earlier, a weary and broken unit of red rimmed eyes and wretched sobs. There was something inherently tragic about the death of someone so young, with lips sticky and sweet from treats and eyes wide, blind to the horrors of the world. </p><p>People were meant to grow. People were meant to be broken. They were meant to leave behind their mothers and fathers, to marry, to conceive children of their own. They were meant to be buried in their own cemetery plots, separated from their parents by a fence, a town, a country. They were not meant to be buried beside the two graves that would someday belong to their father, their mother. Families were not meant to remain whole in death, they were not meant to be buried side by side like that.</p><p>And the school would be closed, a decision that he agreed with. It was unsafe, and he would be damned if another child fell victim to the same cruel hand that had ended young Ginevra's life. Though, he didn't think that anyone else were in danger, if he were being honest.</p><p>He didn't know for certain, but whatever role the youngest Weasley's death had played in, there was no more need for it. No more need for another child to die. </p><p>But children did not need to die to be lost, and the thought alone made Dumbledore sigh once more, his shoulders sagging.</p><p>He was concerned for Harry, concerned by the wide and frightened look in those green eyes. Concerned for the way he made himself small, shrinking into a ball. Concerned by the way he perked up at Tom Riddle's name, as if he had heard it before. As if it meant something. Concerned by the silence, the tightly pinched lips that seemed too purposeful to be unintentional.</p><p>Concerned by the fact that over the past several months, Harry had evidently become quite an accomplished occlumens, and that no amount of prying on his part could allow him in.</p><p>-xXx-</p><p>Harry sat against the tree, the letter clenched within his fist. He read over the words, eyes scanning the page, flicking over them as if they might change. As if he could will them to change.</p><p>'We are sorry to inform you that Hogwarts will not be opening this year...' 'Students have been enrolled into nearby schools, taken into consideration location and eligibility...' 'Mr. Harry Potter has been accepted into Beauxbatons...' 'Travel accommodations have been made and a train will depart from the usual platform of 9 ¾ at King's Cross Station...' 'Students are encouraged to leave the morning of August 31 so as to have time to familiarize themselves with their new schools...'</p><p>He crumpled the paper, holding it in his hands as he chewed his lips. Hogwarts was closed. It was his home, the closest thing he had had of such a thing, and now it was gone. For how long, he did not know. </p><p>His hands were clean, and yet if he strained, he thought he could still see the pink tint. </p><p>He had tried to tell Dumbledore of everything, he really had. He had even on more than one occasion sat down to write a letter, sitting up in bed after trying and failing to sleep for several hours. But the words would not come, and his scar would hiss in pain, roaring to life, blinding him. It was as if a hot poker was being pushed through his eyes, searing his brain. He was bound to secrecy, signing a contract he had not meant to sign.</p><p>He pressed the heel of his palm against his head, breathing in the fresh, earthy scent. Much of the town he lived in had been paved in concrete, buildings clustered together to fit as many in a row as possible. The woods he sat in now were perhaps the only of it's kind for miles, and it had become a haven. Away from the Dursleys. Away from excitable and screaming children at the playground.</p><p>They had not been pleased at all to find that his school had let out early, and that he was expected to return home in May instead of midway through June. A student had died, and they suffered for it. They had taken away his room as punishment, locking him within the cupboard once more, the walls and cobwebs familiar, the spiders that inhabited the corners more of a family to him than the ones beyond the little space underneath the stairs. </p><p>He had written to Hermione and Ron, though Ron was slow to return them, his letters short, bare. He couldn't imagine what the Weasleys were going through, they had even turned down a trip to Egypt offered as a reward from the Ministry. </p><p>He carded a hand through his hair, fingers trembling, tugging too hard at the roots. He exhaled, his chest shaking with the breath. Months had passed, he had not found the diary- the real one, crisp and hardened with blood. He had not spoken to Tom Riddle- to Voldemort- in the same amount of time, and hung his head, heavy with shame.</p><p>The entire time. It had been Lord Voldemort the entire time. He had not known how, he had not known exactly what sort of magic led to a young version of Lord Voldemort existing within the pages of a book. But he did, and Harry had spent an entire school year conversing with him, had confided in him, trusted him.</p><p>He had promised to help him escape the prison, and his hands were coated in blood. </p><p>He could hardly eat with the guilt of it all, and Dudley's old clothes hung even looser on his skinny frame, the contours of his bones pressing too sharply against his skin. He looked sickly, with thick, shadowed bags below his eyes and his skin a sallow color, looking just as gray as the world within the diary had been.</p><p>He hadn't slept, not properly, and all he wanted to do was confess, to tell someone what he knew and the role he had played and apologize because it was all his fault, if he hadn't written in that bloody book none of this would have happened.</p><p>But even the thought of doing so left him with crippling pain, and once when he had brought pen to paper, ready to write it all down for Dumbledore, blood had dripped from his eyes, from his nose. Trickled down his neck from where it slipped over the shell of his ear. He had fainted before he could even write the u in the Headmaster's name, his body thudding to the floor of the empty dining room. </p><p>He had not seen an optometrist, but he had held a hand over his left eye with no glasses on to determine that he had lost most of his vision in his right eye. That there was a bit of a film over it, like a cataract. </p><p>He physically could not admit to it, and he wasn't sure why. </p><p>He startled at the sound of rustling leaves, a twig snapping under someone's weight. He looked up, jumping to his feet and shuffling backwards at the sight of Tom Riddle standing between two trees, his forearms resting against them. He was smirking, lips skewed unevenly so one side was lifted higher than the other, a slight crescent of a dimple forming in his cheek. </p><p>Lord Voldemort had dimples.</p><p>“You,” Harry hissed, lacing the one singular word with as much venom as he possibly could.</p><p>Tom chuckled. “Me.”</p><p>Harry shook his arm, sliding the wand down from where it sat tucked in his sleeve and into his palm, curling his hand around it and aiming it at the wizard in defense. This only made his smirk deepen, his dark blue eyes gleam. “Not happy to see me, Harry? Pity, seeing as how happy I am to see you.”</p><p>“You tricked me!” Harry roared, his voice cracking over the words.</p><p>“Guilty,” Tom said, unabashed by the claim. He took a step forward, pausing as he flicked his gaze over Harry, humming in thought. “You've grown so much over a single summer. Funny how that happens, isn't it? A child one month, practically a man the next.”</p><p>It wasn't funny at all. Nothing he said was funny. </p><p>He should have cursed him, underage magic rules be damned. Surely, defending oneself against the Dark Lord was a special circumstance. But he didn't curse him, chewing his lip instead as he asked the question that had tormented him since the night he awoken covered in blood, “What did you do to Ginny?” </p><p>He needed to know. He didn't want to know, but he needed to. Perhaps if he knew what sort of spell Tom had used to free himself, he could reverse it, vanish him from the world permanently.</p><p>Tom frowned. “I protect you from being arrested for murder- hide all the evidence for you, even go to the trouble of occluding your mind, and you want to repay me by killing me? That isn't very fair.” His tone was light, playful, and it made Harry's stomach coil into a tight knot. </p><p>Occluding his mind? What had that meant? And was he able to read his thoughts?</p><p>His green eyes fell to the ground for a moment, flinching when Tom barked out a sharp laugh. “If you really must know, yes I can read your thoughts. And I did nothing to Ginny. You did it all yourself.”</p><p>He shook his head. “No, I would never-”</p><p>“It's a shame you forgot it all. You might have enjoyed it, the way she cried, begging you to not hurt her. To not kill her,” he said the words as if reminiscing over a fond memory, his lips curled into a small, wry smile.</p><p>Harry's lip trembled, his wand wavering in his grasp. “Why...why would I do that-”</p><p>Tom shrugged. “Because I told you to. You'll find I can be rather persuasive when I need to be.” After a second, he added, “If it wasn't her, it would have been you. The diary leeches onto a soul, whichever one pours itself onto the pages, and siphons the life from them, feeding it to me. I decided I rather liked you, and that another soul would have to do in your place. It took a bit of doing- some rather archaic usage of blood magic, but it did the trick you see.” He thumped a hand against a side, as if it was evidence of how alive he was. That he was flesh and blood and muscles and tissues instead of ink and paper. </p><p>So that was it then? Ginny had died so that Harry wouldn't- yet another instance in his life in which he had lived, another falling in his place. If possible, the guilt mounted even more within him, and he clenched his jaw, ground the crowns of his teeth together. </p><p>Tom took several steps forward, kicking pebbles out before him as he did so. Harry made to step back, to jab his wand forward, but branches burst through the earth, flinging dirt as they wrapped around his ankles, winding tightly around his clothed legs and locking him in place. He stumbled, waving his arms to prevent himself from falling backwards, when an unseen force tugged at his wand, pulling it from his grasp.</p><p>It flew in an arc in the air, settling in Tom's outstretched hand as his fingers curled around it. He held it up, twirling it within his fingers experimentally, skewing his lips in thought. “It's not as good as mine was, but extraordinarily close. Phoenix feather?” he asked.</p><p>“Go to hell,” Harry seethed, digging nails so deeply into his palm that he drew blood.</p><p>Tom took another step forward, until he stood directly before Harry, using the tip of the wand to push aside the air that had fallen over his face. A hand rose, cupping his chin to hold him in place as he looked at the scar with interest, blue eyes narrowed. “You are far more special than you give yourself credit for, Harry Potter,” he murmured. And then he bent his head, placing a chaste kiss to the small fragments cutting over Harry's skin. It sparked, as if electrified, and something shot through him, something delicious and euphoric as if he were whole and complete and Harry was horrified to realize that he had leaned forward, a hand raised pressed flat against Tom's chest to steady himself. </p><p>He quickly brought it back to his side, struggling against the hand that held onto his chin, a second hand reaching out and wrapping around his upper arm. “I'm not special. I'm nothing. Why don't you just kill me and get it over with then? Isn't that what you want- why you tried to kill me in the first place when I was a baby?”</p><p>Tom eyes flashed, the blue turning into red so quickly, so wholly, that it seemed to happen all at once, instead of a transition. The fingers around his chin tightened their hold, nails digging into flesh. “NO!” he roared, and Harry stiffened at the fire in his voice, at the warning that lurked beneath the words. Tom spoke again, his words lower and quieter yet far more frightening, the hair on Harry's arm standing on end. “Nothing will harm you, not if I have anything to say about it. Not me, not Dumbledore, and certainly not that pathetic creature, searching for a new host to play parasite with until he can fix the mess he got himself into.”</p><p>It took only a second for Harry to understand what he meant by creature. Voldemort, the sliver of the man that had fed off Quirrell in his first year. He furrowed his brows at that. Were there two of them then? The younger version of him, stepping out from the encrypted pages of a book, and the one that had always existed, the one that had killed his mother and father?</p><p>And Tom was planning on...protecting him from Voldemort?</p><p>The hand on his chin moved, running through Harry's hair and disheveling it before settling on the back of his neck. “Yes, it does mean I'm protecting you from him.”</p><p>If anything, it was more disconcerting to be offered his protection than to be threatened, and Harry squirmed against the hands that wrapped around him. The roots had risen to his hip, snaking further along him and holding him in place, and he could only wriggle his torso.</p><p>“Let me go,” Harry hissed, raising his hands and shoving against Tom. Not as if it would accomplished much, as he couldn't run anyway, bound by the branches that were thick as his calves. But Tom's grip was too tight on him, and he was too sturdy, and he remained standing before Harry, fingers dinging into his arm, hand cradling his neck.</p><p>Tom shook his head, making the curl fall in front of his face. \"You can't leave me, you can never leave me. Where ever you go I will follow, and where ever you hide I will find you. Even in the deepest depths of the ocean, or in death. You are mine and you belong to me, my love.\" He spoke the words, his voice hardly above a whisper, as if he were making a vow to a lover. </p><p>A desperate sob broke from between Harry's lips, and he shook with anger. Anger that he had ever seen Malfoy slip the journal into Ginny's cauldron, anger that he had taken it and wrote within its pages. Anger that he fell for it, for every caring word, for every pretty lie and broken promise. Anger that he offered his soul away, that he had killed someone else in his own place.</p><p>And all over a book; a simple, blank diary.</p><p>It was something so simple. Something so so unassuming, so innocent seeming. It was just a book. What harm had ever come from a book?</p>\n  </div>"
},{
  "_id": {
    "$oid": "636a6a3736350c4043871849"
  },
  "title": "ButterFly",
  "content": "<div class=\"userstuff module\" role=\"article\">\n    <h3 class=\"landmark heading\" id=\"work\">Chapter Text</h3>\n    <p>&nbsp;<em>\"I thought we agreed not to see each other again, Lily.\"</em></p><p>\n  <em>\"I know, but I'm pregnant, Severus.\"</em>\n</p><p>\n  <em>\"… is it mine?\"</em>\n</p><p>\n  <em>\"I don't know.\"</em>\n</p><p align=\"center\">\n  <em>* * *</em>\n</p><p>\n  <em>\"My potion's clear, his is red. What does that mean?\"</em>\n</p><p>\n  <em>\"It means I need to enact a disownment spell and you need to prepare an adoption ritual, Potter.\"</em>\n</p><p align=\"center\">\n  <em>* * *</em>\n</p><p>\n  <em>\"He's MY son, Sirius.\"</em>\n</p><p>\n  <em>\"A part of him is Snape's son too, James, and I'm sorry but I can't be his godfather.\"</em>\n</p><p align=\"center\">\n  <em>* * *</em>\n</p><p>\n  <em>\"REMUS!\"</em>\n</p><p>\n  <em>\"Sirius, I—\"</em>\n</p><p>\n  <em>\"You son of a bitch, how could you?!\"</em>\n</p><p>\n  <em>\"Sirius, please, let me exp-\"</em>\n</p><p>\n  <em>\"You sold them out! You killed them! Lily and James are DEAD because of you, and you kill Peter too?\"</em>\n</p><p>\n  <em>\"What? Peter's dead? I didn't—\"</em>\n</p><p>\n  <em>\"LIAR! Don't pretend you don't know. After everything we did for you and YOU BETRAYED US ALL!\"</em>\n</p><p align=\"center\">\n  <em>* * *</em>\n</p><p>\n  <em>\"Junior Auror Black, your attack against the Death Eater Spy Remus Lupin, resulting in his comatose state, was a display of excessive force. However, we understand there were extreme mitigating circumstance and your suspension will be lifted pending a review by the department psychologist.\"</em>\n</p><p align=\"center\">\n  <em>* * *</em>\n</p><p>\n  <em>\"Mr Black, this is most irregular!\"</em>\n</p><p>\n  <em>\"I don't care. The law clearly states that a prisoner has to be found fit for execution, and there's no exception to that for werewolves. None of us know what'll happen come the next full moon, so for the safety of the public he has to be kept confined until such a time as he is judged fit for execution. I am providing the funding to build a secure facility for precisely that. If and when he wakes up, you can have him Kissed.\"</em>\n</p><p>\n  <em>\"We do not subject werewolves to the Dementor's Kiss, Mr Black. They are far more dangerous without their soul than with.\"</em>\n</p><p>\n  <em>\"Then make an exception. Behead him with silver immediately afterwards for all I care, but I want to see that son of a bitch Kissed first. His soul doesn't deserve the reprieve of a clean death.\"</em>\n</p><p align=\"center\">\n  <em>* * *</em>\n</p><p>\n  <em>\"Why are you here, Black? My trial is over, the Auror department has no—\"</em>\n</p><p>\n  <em>\"I'm not here as an Auror, Snape. I'm here as James' best friend.\"</em>\n</p><p>\n  <em>\"As if that is any better. After what Lupin did—\"</em>\n</p><p>\n  <em>\"Don't talk to me about him, Snape. I'm here about you, and Harry. I know you're his father.\"</em>\n</p><p>\n  <em>\"No, I'm not.\"</em>\n</p><p>\n  <em>\"You're the closest he has to it, which is depressing, but—\"</em>\n</p><p>\n  <em>\"What do you want, Black?\"</em>\n</p><p>\n  <em>\"Take him. Claim Harry as your son. Even disownment can be undone if the adopted parents die.\"</em>\n</p><p>\n  <em>\"You're mad. I'm the furthest thing from suitable parent material. Dumbledore placed him somewhere safe, he assured me of that. Why would you ever suggest I should take him?\"</em>\n</p><p>\n  <em>\"Safe? Snape, do you actually know who Dumbledore put him with?\"</em>\n</p><p align=\"center\">\n  <em>* * *</em>\n</p><p>\n  <em>\"You're not welcome here! Leave! Now!\"</em>\n</p><p>\n  <em>\"Why? So you can treat the boy like you treated Lily? Either let me in, or I will make you, Petunia.\"</em>\n</p><p>\n  <em>\"Don't threaten me, Severus. I know you're not allowed to use&nbsp;<strong>that</strong>&nbsp;against normal people.\"</em>\n</p><p>\n  <em>\"Do you really think that will stop me?\"</em>\n</p><p align=\"center\">\n  <em>* * *</em>\n</p><p>\n  <em>\"Are you going take him away?\"</em>\n</p><p>\n  <em>\"No. Just make sure you don't mistreat him.\"</em>\n</p><p>\n  <em>\"Why do you care, Severus? I know you and Lily fell out years ago. Why this interest in her son?\"</em>\n</p><p>\n  <em>\"You didn't care much for her either, Petunia. Why did you take him in?\"</em>\n</p><p>\n  <em>\"She was my sister.\"</em>\n</p><p>\n  <em>\"And she was my friend.\"</em>\n</p><hr><p>Anita Darzi was a witch. At least, Harry Potter—six years and eleven months old—was pretty sure she was a witch. Strange things had been happening at Little Whinging's Primary School, things Harry was pretty sure&nbsp;<em>he</em>&nbsp;wasn't responsible for. He had a few incidents of accidental magic—turning his teacher's wig blue, ending up on top of a roof—but he didn't think he was the one who'd turned the skipping ropes into snakes, made footballs explode into swarms of flies, or caused Peggy Elliot to suddenly start speaking in tongues.</p><p>He wasn't totally sure it was Anita until a week before the end of the summer term, when two wizards came to the school. Harry first noticed them at lunch break, when he looked up from boredly ripping up handfuls of grass to see them walking across the playground with the headmistress. They didn't look like wizards, dressed in neat suits instead of robes. They were both quite tall—although Harry, on the shorter side of average, found many adults quite tall—and one had very dark skin, a bald head, and a gold ring in one ear, whilst the other was white and lightly tanned with dark hair and a face that Mrs Stafford, the Year Six teacher, called devilishly handsome.</p><p>Harry knew him. He's seen pictures of that man as a teenager and young man, grinning alongside Harry's father. Sirius Black. He was an Auror now, Harry knew; Severus Snape had told him when Harry asked about all the people in the photos with his parents. Snape didn't like Sirius, who'd bullied him when they were at Hogwarts, so Harry didn't like him either. Harry was picked on by his cousin so he had no patience for bullies, even grown up ones.</p><p>At the end of lunch, he returned to his classroom with everyone else to find Sirius and the other Auror sitting at the back of the classroom, the child-sized chairs looking exceptionally small under their large figures.</p><p>\"Children,\" said Mr Gibbon, the teacher, when they were all seated on the carpet, \"these two gentlemen are from Ofsted. They're going to be watching over our lessons for the afternoon, but I want you to just ignore them and carry on like normal.\"</p><p>There was a moment of silence as the children all did exactly the opposite and stared at the two men. Sirius smiled and waggled his fingers in a wave; the other one simply stared.</p><p>\"They don't look like they're from Ofsted,\" pronounced Tony Hopper sceptically.</p><p>Sirius leant forwards slightly. \"What d'you think people from Ofsted should look like?\"</p><p>\"Old.\"</p><p>\"Tony!\" Mr Gibbon scolded, but Sirius laughed, though his companion didn't.</p><p>Tony scowled at Mr Gibbon. \"People at Ofsted are old,\" he insisted. \"My grampa works for them and he said all the people at Ofsted are old fogies and he's the oldest fogie of all!\"</p><p>Mr Gibbon was stumped by this, unsure of how to respond, but Sirius said to Tony, \"We're old fogies in training. It's a hard job, being an old fogie, and you have to start practising young. You sound like an expert though; how am I doing?\"</p><p>\"Not very well,\" Tony told him in an unapologetic tone. \"Old fogies aren't so friendly, 'cept to their favouritist grandkid.\" He paused, glanced at the black man, and added, \"He's doing better.\"</p><p>\"Hear that, Kingsley,\" Sirius said. \"You'll be a proper old fogie before you know it.\"</p><p>Kingsley's expression didn't change. \"I'm storing my friendliness for my favourite grandkid.\"</p><p>This made Sirius laugh. Mr Gibbon cleared his throat and Sirius sat back with an apology, miming zipping his mouth shut but still smiling as he gestured for Mr Gibbon to carry on.</p><p>Being almost the end of term, they didn't even have proper lessons and they spent the afternoon doing art. Harry was glad for that. It meant he could sit at a table as far from the two men as possible, discreetly watching them. Some of the other kids were a bit more obvious about it, whispering to their friends in between glances, quietly coming to agree with Tony. They had to when Sirius and Kingsley looked over the classroom with stern gazes more suited to experienced police detectives than school inspectors, when Kingsley never took one hand from his pocket, and when Sirius put on a pair of rose-tinted glasses.</p><p>Harry watched it all with his head down, peering over the rims of his own normal glasses. He didn't really need his glasses for art work, only for things like reading, but it was easier to keep them on all the time at school to avoid losing them. His hair, which for a while after bathing would sit like a wild bird's nest atop his head, was moving into the greasy stage that followed and so his fringe hung heavily over his eyes, further hiding his gaze from view.</p><p>He watched Sirius look around the classroom, settle his gaze on Anita, who sat at the same table as Harry, and stare for several moments before nudging Kingsley and handing the glasses over. Kingsley put them on and peered at Anita before handing them back and exchanging a few words with Sirius. Sirius got up then and began nonchalantly moving around the classroom, pausing to remark on the occasional painting or drawing as he gradually made his way around to Harry's table. He shared it with Anita, Sarah Carter, and John Gamble, and Sirius crouched between Harry and Sarah. Harry focused so hard on not making it obvious that he was watching the man that he didn't realise he was painting the grass purple.</p><p>\"What's your name then?\" Sirius asked Sarah, who told him and then asked for his. \"I'm Sirius. Is that your house?\"</p><p>Sarah nodded, carefully dabbing green paint along one side to create textured bushes in front of the red-brick building. \"That's a funny name.\"</p><p>\"I'm a funny person. What about you three?\" he asked the rest of the table. \"What are your names?\"</p><p>They introduced themselves, John excitedly, Anita warily, and Harry with just a shrug.</p><p>\"That's an interesting name. It's nice to meet you, shrug.\"</p><p>\"His name's not shrug, it's Harry,\" Sarah provided helpfully. \"Harry Potter.\"</p><p>Sirius stared at Harry, mouth gaping slightly. His grey eyes flicked briefly from Harry's eyes to the scar on his forehead and he made a strange sound, a strangled sort of squeak, and then he snapped his mouth shut tightly. For a moment he seemed to struggle over what to do next, but eventually he said stiffly, \"Well. Harry. Grass is green, not purple.\"</p><p>Sarah giggled. Harry flushed, glancing down at his picture.</p><p>\"I know that!\" he snapped. \"It's… it's…\"</p><p>\"Art-stick lie-sense?\" Sarah provided.</p><p>\"Yeah!\" Harry said, although he had no idea what art-stick lie-sense was. It sounded good and everyone knew Sarah was the best artist in class.</p><p>\"Uh huh,\" Sirius said. \"Well. Carry on, children.\"</p><p>He got up and stalked over to Kingsley and it was only then that Harry noticed Sirius slipping a wand back into his pocket. He watched with narrowed eyes as Sirius spoke briefly to Kingsley, who glanced over to Harry dispassionately then narrowed his eyes ever so slightly when he looked at Anita, and then Sirius turned and walked briskly out the classroom, ignoring the surprised look from Mr Gibbon.</p><p>\"I don't think they're from Ofsted either,\" John said thoughtfully. \"He was weird.\"</p><p>Harry said nothing. Kingsley sat back down.</p><p>\"What's art-stick lie-sense?\" John asked Sarah.</p><p>\"It's when an artist paints something that's not real but it looks prettier. That's why it's a lie, see? But it makes sense because everyone knows why you're lying and that it's for a good reason.\"</p><p>\"Oh. Okay.\"</p><p>It was only at the end of the class, when John showed off his painting of a pink dog under a bright blue sun, that they found out it was actually called artistic licence and that Mr Gibbon preferred realism.</p><hr><p>A few days later a new moon hung over Little Whinging and a conveniently placed tree allowed Sirius Black to stand hidden from the street lights, keeping him unseen by any still-awake Muggles that might be looking out their windows. Sirius liked new moons. It was easier to forget about old friends and traitors without that glowing reminder in the sky.</p><p>\"Sirius.\"</p><p>He didn't jump at the sound of the quiet voice, but only just. A familiar old figure approached, standing beside him in purple robes and fixing his gaze on the house across the street.</p><p>\"You should know better than to creep up on Aurors, Dumbledore,\" Sirius said.</p><p>\"Did you solve the trouble at the school?\" Dumbledore asked in reply.</p><p>\"It wasn't dark wizards.\"</p><p>Surprised flickered across Dumbledore's face. \"You said the magic occurring at the school was dark.\"</p><p>\"I know, but not by wizards. One of the girls was possessed by a demon. Anita Darzi.\"</p><p>Dumbledore's surprise this time was more obvious. He stared at Sirius. \"Demonic possession in a&nbsp;<em>child</em>?\"</p><p>Sirius sighed and nodded. \"I noticed her aura was extremely dark through the AR glasses. We got her name and address from the school records, investigated the house and family, confirmed that she was possessed. Also found out the older brother had been abusing her and it looks like she's a witch. We dealt with the possession, told them about magic and put them in contact with a Squib therapist that can hopefully help the girl deal with the possession, and alerted the Muggle authorities about the brother.\"</p><p>Dumbledore shook his head, sighing wearily. \"That poor girl.\"</p><p>They were silent for a while. It was a warm night, but neither man was bothered by it in their long robes, cooling charms keeping them untouched by the heat. A cat wandered over, rubbed against Dumbledore's leg, and hissed at Sirius, who responded with a low, canine growl that sent the cat running.</p><p>Dumbledore was the first to speak again, voice quiet. \"He's safe there, Sirius.\"</p><p>Sirius scowled. \"I'm not thinking of kidnapping him.\"</p><p>\"Aren't you?\"</p><p>\"No,\" he answered quickly. When Dumbledore raised a sceptical eyebrow, he sighed. \"A little. But I won't. I told you when—after—I just know that Lily's sister is the kind of Muggle my parents talked about, and she'd probably hate for Harry to be living with her, but I won't take him away. You said he's protected there and I… I'm not his godfather for a reason.\"</p><p>\"What was it again?\"</p><p>\"If you don't already know—\"</p><p>\"Then you won't tell me,\" Dumbledore finished with a sigh. \"At least tell me—do you wish you were?\"</p><p>Sirius shifted, eyes staring at the window on the left of number four. There was the faint glow of a night-light visible through the curtains but otherwise the house was dark and quiet.</p><p>\"No,\" he said quietly. \"They had a good reason to not pick me. I just… seeing him the other day, I couldn't help thinking about them. Wondering how much of them is in him. I could never have been his godfather, but I wish I'd been the Secret Keeper. I wish Lupin hadn't betrayed us all.\" He paused, then added in a quieter and yet more threatening tone, \"I wish I hadn't cursed him as hard as I did so I could see him get Kissed.\"</p><p>\"Is that why you had the prison built?\"</p><p>\"Death's too good for him. He ever wakes up, he's getting Kissed.\"</p><p>\"They will have him executed anyway,\" Dumbledore said. \"A werewolf with no soul—it's a more dangerous thing than one with.\"</p><p>\"Let them, when it's done,\" Sirius said dismissively. \"Let them behead him with silver and burn the remains, but I want to see him suffer first.\"</p><hr><p>Every summer, the very day after Harry finished school, Severus Snape picked him up from Privet Drive and Apparated him to Cokeworth, where Harry would spend four weeks before Snape had to return to Hogwarts to begin preparing for the upcoming school year.</p><p>They were the highlight of Harry's life. He relished those four weeks where he didn't have to put up with his stupid fat cousin who didn't have half as many chores and got all the easy ones, or get called nothing but 'boy' by his aunt and uncle, or pretend to be a Muggle. He didn't even complain about the fact that Snape made him do school work during the summer holiday, because it wasn't boring sums and spelling. Snape taught him how to make potions to cure colds or just to give people fun dreams and help them sleep, letting Harry help him crush beetles and weigh plants. It was one of his favourite things to do with the man, because potions were Snape's passion and he was always most relaxed when brewing.</p><p>When Snape picked him up this year, Harry brought up Anita and Sirius as soon as he was settled in at Snape's home.</p><p>\"Sirius Black was at my school last week.\"</p><p>Snape's expression turned sour in an instant, face darkening with a scowl, hands jerking slightly as if he wanted to grab his wand. \"What would an Auror be doing at a Muggle primary school?\"</p><p>\"One of the girls is a witch,\" Harry told him. He sat on the sofa in Snape's living room while Snape was settled in his armchair. \"Anita Darzi. She's been turning skipping ropes into snakes and a football exploded and it was full of bugs and one of the other girls, Peggy Elliot, she started speaking funny after she teased Anita for liking lizards. Then Sirius Black came to my school and Anita wasn't there for the whole last week of term.\"</p><p>\"That's a little extreme for accidental magic,\" Snape remarked, \"but Aurors don't investigate incidents of children's magic. Black had no reason to be there. Was he alone?\"</p><p>Harry shook his head. \"There was another man with him. I think his name was Kingsley.\"</p><p>If Snape recognised the name, he gave no indication of it. \"Did either of them speak to you?\"</p><p>\"Sirius asked what my name was, but he asked everyone at my table. He stared at my scar. I think he was surprised to see me.\"</p><p>\"Hm.\"</p><p>\"I don't think he likes me,\" Harry added, remembering it. \"Why wouldn't he like me? You told me he was my daddy's friend.\"</p><p>\"He's also a bully, and bullies don't have reasons for disliking people.\"</p><p>Harry thought about this. \"You said my daddy was a bully too. Do you think he didn't like me neither?\"</p><p>Snape's mouth tightened slightly but his voice softened. \"I'm sure your father liked you, Harry.\"</p><p>\"Do&nbsp;<em>you</em>&nbsp;like me?\"</p><p>\"Do you think I would bring you here every summer if I didn't like you?\"</p><p>\"Why do you like me though?\"</p><p>\"Why wouldn't I?\"</p><p>Harry shrugged. \"I wouldn't like someone if their daddy bullied me. If someone's daddy is a bully they're probably a bully too. Dudley is, just like Uncle Vernon.\"</p><p>Snape leant forward, resting his elbows on his knees, dark eyes boring into Harry's green ones. \"Are you a bully?\"</p><p>\"No!\" Harry cried before Snape even finished asking. \"I don't bully people.\"</p><p>\"Then I have no reason to dislike you.\" He leant back again, glancing away. \"You take after your mother, Harry. She was my friend and I owe it to her to make sure you grow up well.\"</p><p>\"Does that mean you'll take me away from my aunt and uncle?\" Harry asked slyly. \"I'd grow up good if I wasn't living with them.\"</p><p>Snape gave him an unforgiving look. \"I've told you before—No. There are protections on your aunt's house that keep your safe from the Dark Lord.\"</p><p>\"But he's gone, you told me.\"</p><p>\"But not dead, and we don't know how long he's gone for or where he's gone to. Until you're old enough to look out for yourself, you have to stay with your aunt.\"</p><p>Harry puffed himself up, straightening his back. \"I can look out for myself.\"</p><p>Snape very rarely smiled, but his mouth quirked slightly at that. \"Oh? Do you know the wand movements for a basic shield charm? Or the incantation?\"</p><p>Harry drooped. \"No.\"</p><p>Snape stood up. \"I'd better show you then. Get your trainers.\"</p><p>Harry leapt up, running to grab his trainers from their spot by the front door then running back and sitting to put them on. \"If I learn to do the shield charm, can I leave my aunt's house?\"</p><p>\"You can leave your aunt's house when you're a qualified wizard.\"</p><p>Harry considered that. \"Will I be qual-ee-fed if I learn the shield charm?\"</p><p>\"Qualified,\" Snape corrected, and carried on only when Harry repeated it correctly. \"No. You'll be qualified when you're seventeen.\"</p><p>Harry scrambled up, laces trailing. \"That's forever away!\"</p><p>\"It's ten years.\"</p><p>\"Yeah, forever!\"</p><p>Snape scowled. \"It's not forever, it'll be over before you know it. Now do up your laces so we can go before I change my mind and you can spend the afternoon helping me clean the kitchen instead.\"</p><p>The field where they practised spells was an hour's walk from Spinner's End, abandoned and therefore well away from any Muggles that might see them. Snape would show him spells and then let Harry try casting himself. Thus far he hadn't managed to do more than conjure sparks and today was no better, but he enjoyed trying.</p><p>On the way back, Snape abruptly grabbed Harry under the arms and jerked him up, making him yelp.</p><p>\"<em>Stupid human!</em>\"</p><p>\"<em>I'm not stupid!</em>\" Harry snapped as Snape put him down, staring at the snake that was hissing at him from between the grass, the one he'd almost trodden on. Then he gasped and grabbed at Snape's sleeve, looking up wide-eyed. \"Severus, that snake talked!\"</p><p>Snape was staring at Harry just as wide-eyed as Harry stared at him, mouth hanging open.</p><p>\"<em>Stupid human,</em>\" the snake repeated. \"<em>Nearly trod on me.</em>\"</p><p>\"<em>I didn't mean to,</em>\" Harry defended himself. \"<em>I just didn't see you.</em>\"</p><p>\"<em>Big foot, stupid,</em>\" the snake hissed once more, then slithered off, disappearing under a bush.</p><p>Snape snapped his mouth shut and swallowed audibly. \"Harry, you… you're a Parselmouth.\"</p><p>\"No I'm not,\" Harry denied instantly, responding to the tone more than the statement, then asked, \"What's a Parselmouth?\"</p><p>\"It's someone who can speak to snakes.\"</p><p>\"Oh. But I can't, it was just that snake was talking English.\"</p><p>\"No,\" Snape said quietly, \"it wasn't. It was hissing, speaking snake language. You hissed back.\"</p><p>Harry thought about it, frowning. \"I don't think I was.\"</p><p>\"Trust me, Harry. You were. I don't know what you said to that snake; all I heard was hissing.\"</p><p>\"It called me stupid and I said I wasn't. Was I really hissing? Is it bad?\" he asked when Snape nodded.</p><p>Snape hesitated. \"No. Not really, but… Harry, this is important so I need you to listen carefully.\" He crouched, putting himself more on eye level with Harry. \"There are a lot of people who think that being a Parselmouth makes someone a dark wizard. That it makes you evil.\"</p><p>\"Why do they think that?\"</p><p>\"Because Salazar Slytherin and the Dark Lord could both talk to snakes, and it's made a large number of people think that Parseltongue—that's the language that Parselmouths speak—is evil.\"</p><p>\"But you said it's not.\"</p><p>\"It's not. It's just a language, Harry. It makes you no more evil than speaking French would, but not everyone is as clever as I am. You're clever as well, so you have to understand that other people are stupid and think it's bad for you to speak to snakes, and you have to keep it a secret.\"</p><p>Harry nodded, not completely understanding but believing that what Snape said was the truth and agreeing to keep his newly discovered ability secret.</p><hr><p>On the thirty-first of July, Harry woke up early. He had his own room at Snape's house, smaller than his one at Privet Drive but, in his opinion, nicer. At the Dursleys, he wasn't allowed to put anything on the bland magnolia walls 'because it'll ruin the paintwork', even though Dudley was allowed to, and he had plain blue bedding. At Snape's, he had green walls and photos of his parents, he was allowed to tack up any pictures he drew, and his bedding was Care Bears to go with his Bedtime Bear. At Privet Drive, he had almost no toys or games and was forbidden from touching Dudley's; at Snape's, he had puzzles, board games, and a handful of&nbsp;<em>Famous Figurines</em>, a range of magical action figures modelled after various famous witches and wizards. He was intent on collecting them all, but for now only had two four-figure sets—the Hogwarts Founders Edition and the Albion Edition.</p><p>He left his room only to use the bathroom then returned and pulled out a colouring book and some crayons and spent almost an hour colouring a hippogriff blue and pink. (Mr Gibbon might prefer realism, but Harry was fond of using his newly discovered artistic licence.) He checked the clock on his wall almost every five minutes and only when it read exactly seven o'clock did he abandon his colouring things and scurry across the hallway to Snape's bedroom, knocking hard on the wood then listening carefully for a response.</p><p>\"What?\" came the gravely, half-asleep reply.</p><p>\"It's seven o'clock. Are you awake?\"</p><p>\"No.\"</p><p>\"Yeah, you are. You're talking. Can I come in?\"</p><p>There was a grunt, which Harry took to mean yes. He pushed the door open and edged into the dark room, sidling up to the bed where Snape was buried under the covers, just the very top of his head visible. Harry climbed onto the bed, bouncing slightly.</p><p>\"Sev-e-rus,\" he sing-songed. \"It's time to get up.\"</p><p>\"Potter,\" Snape growled without pulling the covers down, \"if you don't stop bouncing I'm going to transfigure your legs into worms.\"</p><p>\"You wouldn't really do that,\" Harry said, but he stopped bouncing nevertheless.</p><p>\"I would.\"</p><p>\"That'd be bullying.\"</p><p>\"That'd be revenge, there's a difference. Go back to bed.\"</p><p>\"But it's seven o'clock and you said I can get up at seven o'clock on my birthday.\"</p><p>Snape sighed and rolled onto his back, pulling the cover down but keeping his eyes closed. \"It's not your birthday.\"</p><p>\"Yes it is.\"</p><p>\"No, I definitely remember it was your birthday last year.\"</p><p>\"It's every year!\"</p><p>\"That sounds greedy.\"</p><p>\"Everyone has one every year, so everyone is greedy then. So come&nbsp;<em>on</em>. I wanna open presents and Gareth is coming over and you said we can go to the museum today and look at the dinosaur skeletons.\"</p><p>Snape groaned and finally opened his eyes, glowering at Harry but without any real malice. \"You're still in your pyjamas. Get dressed and I will get up.\"</p><p>Harry was out of the room in a flash. By the time he changed out of his pyjamas, Snape was in the shower. Harry waited impatiently for him to finish and dress, then grabbed Snape's hand as soon as he came out and tugged him to the stairs, hurrying down almost too fast to be safe. When he reached the kitchen and found a small pile of gifts on the table, he hopped about in an excited little jig.</p><p>\"Presents!\"</p><p>\"Is that what they are?\" Snape asked, yawning. \"They look to me like mess taking up my kitchen table.\"</p><p>\"Presents aren't a mess!\"</p><p>\"Well if they don't disappear soon then neither of us is getting breakfast and I get grumpy without breakfast.\"</p><p>\"You're always grumpy,\" Harry remarked, earning himself a baleful glare. He shrugged. \"Well you are grumpy a lot.\"</p><p>\"Open your presents,\" Snape replied simply. \"What do you want for breakfast?\"</p><p>\"Eggs and soldiers, please.\"</p><p>Order given, he climbed onto a chair and gave his attention to the presents. There were five, which was only a fifth of what his cousin got every year, but Harry didn't mind. He'd seen his cousin get mountains of gifts at birthdays and Christmas, but he'd also seen Dudley lose interest and abandon half of those gifts within a month of getting them. This, Harry decided, was the result of having too many things to properly give his attention to each of them, so he decided that fewer presents were better.</p><p>Three of them were from Snape: a book of stories, some new clothes, and&nbsp;<em>Famous Figurines: Potion Masters Edition</em>. The fourth was from Albus Dumbledore; Harry had never met him but every birthday and Christmas he sent a large box of sweets, which made Snape mutter about how all Harry's teeth would fall out. The fifth was from all the other teachers at Hogwarts, a colouring book whose pictures would move when they were filled in with the accompanying magical colouring pencils.</p><p>When he'd cleared the wrapping paper away and Snape served up their breakfast, Harry tapped the Famous Figurines box on the side of the table. \"Why aren't you in here?\"</p><p>\"I'm not famous.\"</p><p>\"Why not? You make really good potions. And you're a Hogwarts teacher.\"</p><p>\"Hogwarts has had hundreds of potion masters before me and will have a hundred more after. A person has to be more than 'really good' to become famous.\"</p><p>\"But you're super good!\" Harry insisted.</p><p>\"Until I do something unique and worthwhile, even being super good isn't enough.\"</p><p>\"Then you should do something like that,\" Harry said, not entirely sure what he meant. \"Then you can have a figurine made of you.\"</p><p>\"I don't think anyone would want a figurine of me,\" Snape told him blandly.</p><p>\"I would.\"</p><p>Snape didn't respond to that immediately, eating a spoonful of cornflakes. Harry couldn't read his expression, but eventually Snape cleared his throat and said, \"That's kind of you to say, Harry.\"</p><p>Harry grinned at him and carried on with his eggs and soldiers. After, he fetched his other figurines and convinced Snape to play with him on the living room floor, taking Glover Hipworth from his new set to brew some healing potions for Morgana Le Fay from the Albion Edition, who got in a fight with Salazar Slytherin. Snape wasn't impressed that Harry declared Morgana the winner.</p><p>\"Salazar Slytherin was the best wizard of his age.\"</p><p>Harry held up both figures. \"Morgana's younger. She doesn't have any grey hair like Salazar. So she'd beat him.\"</p><p>\"That isn't quite what I meant. Salazar was an immensely powerful wizard.\"</p><p>\"Morgana was a super powerful witch. She could beat him. You just think she couldn't 'cause she's a girl.\"</p><p>Snape frowned. \"Where did you get that idea?\"</p><p>Harry shrugged, setting Morgana's figure down beside Glover to await her healing potion and picking up Rowena Ravenclaw. \"It's what Anita Darzi at my school says whenever one of the boys says they can beat girls at anything. Tony Hopper says boys are better than girls at everything, but I don't think that's true because girls are just the same as boys pretty much. They've got the same arms and legs and a brain and stuff. It's just that they sometimes wear dresses or skirts instead of trousers and they have to sit down to pee.\"</p><p>Further discussion was cut off by a sharp knocking at the door. Harry immediately abandoned his toys to leap up and rush over to it. \"Gareth's here!\"</p><p>Snape scrambled up after him, grabbing Harry by the shoulders before he could yank the door open.</p><p>\"What have I told you?\" he scolded. \"You do not answer the door, Harry.\"</p><p>Harry pouted. \"But it's just Gareth.\"</p><p>\"You don't know that. It could be anyone.\"</p><p>\"But it's—\" He broke off at Snape's glare, shuffling his feet and sighing petulantly. \"Fine. 'm sorry.\"</p><p>\"Good. Go back to your toys.\"</p><p>Harry started to do so then changed direction and made for the stairs instead. \"I gotta get his present!\" he yelled back as he clambered up them. He ran to his room, dropped to his knees in front of his drawers and pulled open the bottom one to take out a badly wrapped present, leaving the drawer hanging open when he hurried out again.</p><p>When he got downstairs, a young white man about Snape's age was on the sofa, Snape settled in the armchair opposite. He had dark reddish-brown hair tied in a ponytail that reached his lower back, was clad in Muggle jeans and a t-shirt, and there was a large, gaudily wrapped square package sat on the floor beside him. He was Snape's friend and cousin and the Muggle Studies teacher at Hogwarts.</p><p>\"Gareth!\" Harry greeted loudly, bounding up to him with a grin and thrusting the present under his nose. \"I got you a present, I wrapped it myself too. Happy birthday. Is that one for me?\"</p><p>Gareth took the present, lowering it so he could actually look without crossing his brown eyes, but he was smiling. \"I don't know. Is your name Harry?\"</p><p>\"You know it is!\"</p><p>\"Then I guess it must be because it says 'To Harry' on it, although I'm not sure why&nbsp;<em>you're</em>&nbsp;getting presents on&nbsp;<em>my</em>&nbsp;birthday.\"</p><p>\"'Cause it's my birthday too.\"</p><p>Gareth huffed. \"I need to complain to someone in that case. No one asked me if I wanted to share my birthday, and seeing as I'm older I think we'll have to move yours to another day.\"</p><p>\"I don't think you can move birthdays,\" Harry told him earnestly. \"Do you really not like sharing with me?\"</p><p>Gareth's expression softened. \"Nah, I don't mind. Are you going to open your present?\"</p><p>Harry shook his head. \"You first.\"</p><p>\"Alright. Let's see here…\" He tore away the paper with some difficulty, the entire thing wrapped in as much sellotape as paper, but eventually got it free to reveal a brightly coloured mug with his name painted on it.</p><p>\"I painted it myself,\" Harry told him, looking nervous. \"We went on a school trip to a pottery—that's a place where they make mugs and bowls and stuff—and we were all allowed to paint one thing to take home. Do you like it?\"</p><p>\"It's wonderful, Harry. Thank you.\"</p><p>Harry beamed at him and turned his attention to his own gift. Beneath the paper was a plain brown box, more than half as tall as Harry, and Gareth warned him to open it carefully and from the top. He did so, unfolding the flaps to peer down into the box.</p><p>\"Lego! Is it a castle?\"</p><p>Smile almost as big as Harry's, Gareth levitated the pre-built model from the box and set it on the floor. Harry gasped and even Snape, whose mouth had tightened at the cry of Lego and the thought of his house being overrun with little blocks, couldn't contain an astonished noise.</p><p>\"It's Hogwarts!\" Harry cried.</p><p>It was, three feet tall and perfectly proportioned, complete with a lake, Quidditch pitch, and the edge of the Forbidden Forest. There was even a Lego squid in the lake. Gareth slid down from the sofa to show Harry where the castle opened up, revealing a Great Hall filled with students and teachers, staircases that could move, and even hidden passageways that Harry would have to find for himself.</p><p>\"It's so cool!\" Harry breathed, staring in amazement. \"But Lego is Muggle. How'd you get one of Hogwarts?\"</p><p>\"Built it myself.\"</p><p>\"Wow! That must have taken forever!\"</p><p>\"A while,\" Gareth agreed. \"Take a closer look at the people in the Great Hall.\"</p><p>Harry got down on his belly to peer closer, looking over the hundreds of little figures. All four student tables were filled, each with their house crest painted on the front of their black robes, and the staff table had a variety of teachers including, Harry realised, real people. He pulled out the one in the headmaster's chair and held it up for Snape to see.</p><p>\"That's Dumbledore!\"</p><p>\"It certainly is,\" Snape agreed, but Harry had already turned back to the castle and was pulling out another figure.</p><p>\"And you!\"</p><p>Snape blinked and took it from him. He stared at it for several moments then looked over at Gareth, who didn't bother trying to hide a smile.</p><p>\"Really?\" Snape asked him, and he just shrugged.</p><p>Harry spent the morning playing with it, his&nbsp;<em>Famous Figurines</em>&nbsp;now delegated to being the giant villains against whom the Lego characters had to defend themselves and the castle. He was even reluctant to stop for lunch and birthday cake until Snape said they'd be going to the museum afterwards.</p><p>As always when they went anywhere near wizards, Snape put a Concealing Charm on Harry to hide the scar on his forehead, then all three of them Apparated to the Leaky Cauldron pub and took the underground to the London Museum of Natural History. Harry spent the afternoon dragging the two adults from display to display, getting them to read the information plaques because he hadn't brought his reading glasses with him, marvelling over dinosaur bones and wax statues, and never noticing when Snape clenched his fists and glared at the other visitors.</p><p>\"Remind me why I'm here,\" Snape muttered to Gareth when they were in the particular busy insect section, where Harry had his nose to the glass of the butterfly display cases until Snape called to him to stand back a bit.</p><p>\"Because you're too pragmatic for theme parks and too soft to not take him out for his birthday.\"</p><p>\"I'm not soft,\" Snape growled in reply.</p><p>\"You're a little bit soft. Just soft enough for a seven year old.\" When Snape's scowl didn't fade, Gareth leant in a little and added in a stage whisper, \"Don't worry, Severus, I won't tell anyone.\"</p><p>\"I'm going to poison you.\"</p><p>\"Nah, you won't. Whoa,\" he added, staring at a woman who'd just entered with another crowd of people. \"Don't see that everyday.\"</p><p>He was referring to the woman's attire, which was a navy, 1870s style dress, complete with a matching hat. She completely ignored the looks people gave her, but had a kind smile for anyone that complimented her dress. She was quick to correct anyone that thought she was a museum employee who'd wandered in from the Victorian-era section, gesturing to the young girl with her who was dressed more normally in shorts and t-shirt.</p><p>\"Why come out like that when she knows she'll get so much attention?\" Snape muttered, disapproval evident in his voice.</p><p>\"Because not everyone cares about the attention they draw,\" Gareth replied. \"She pulls it off well. I wonder if she's single.\"</p><p>\"I thought you were in a relationship with Sinistra.\"</p><p>\"We're not exclusive.\"</p><p>\"Does she know that?\"</p><p>Gareth scowled at him. \"I'm not a cheater. Not in relationships, anyway.\"</p><p>Snape snorted and shook his head. \"Harry, are you ready to move on?\"</p><p>Harry drew away from the butterfly display with some reluctance, but when he noticed the increased amount of people in the room he took Snape's hand and kept close as they headed for the next section.</p><p>\"Severus, can I get a butterfly pet?\" he asked.</p><p>\"No,\" Snape answered without hesitation. \"Butterflies aren't pets.\"</p><p>\"Why not?\"</p><p>\"You can't tame them. They would fly away.\"</p><p>\"What if I kept it in a cage?\"</p><p>\"Would you like to be kept in a cage?\"</p><p>\"No, but I'm a person. I'm too big for a cage.\"</p><p>\"A butterfly probably feels the same way,\" Snape told him. \"They don't live very long and I'm sure they don't want to spend their few weeks of life stuck in a cage, even a big one.\"</p><p>\"I guess. Can I get a different pet?\"</p><p>\"That's not something I can decide, Harry. It would be living at your aunt's home; you would have to have her permission.\"</p><p>Harry's shoulders slumped. \"She'll never let me have a pet.\"</p><p>\"She'll have no choice when you go to Hogwarts,\" Gareth remarked. \"Every Hogwarts kid deserves a pet and Petunia can stick her objections where the sun doesn't shine.\"</p><p>Harry giggled at that and Snape's mouth quirked, though he tried to hide it.</p><p>They went to the gift shop at the end and Harry was looking at a book about gory battles in history when the little girl with the woman in the Victorian dress came up to him. She stood by him for a minute, glancing between the shelf of books and Harry, while the woman with her inspected the adult section of books, and then blurted out, \"You shouldn't buy that. It's wrong.\"</p><p>Harry looked at her, startled. The girl was about his own age with black hair tied in a short braid and ears that stuck out from her head. She was of east Asian descent, but her accent was pure northern English.</p><p>\"How do you know it's wrong?\"</p><p>\"My mum and dad said all history books are wrong because they're written by people who weren't alive when that stuff happened.\"</p><p>\"That's 'cause it's not history until everyone that was alive dies. If they're still alive, it's the present.\"</p><p>\"My mum and dad were alive when it was history,\" the girl argued. \"My daddy has been alive for ever and ever. He knows all about history.\"</p><p>\"You're lying. People can't live for ever and ever.\"</p><p>\"My daddy—\"</p><p>\"Victoria!&nbsp;<em>Vous ne pouvez pas dire aux gens que.</em>\"</p><p>The girl scowled up at the woman in the Victorian dress. Harry wasn't sure if the woman was her mother or not; she was white with dirty blonde hair, in her early thirties, but Harry had learnt about adoption just a few months ago.</p><p>\"<em>Pardon,</em>\" the girl said sulkily. \"<em>Mais c'est vrai.</em>\"</p><p>The woman didn't answer that, turning her attention to Harry. \"What Tori means is her parents are historians that have found evidence contradicting many things the history books say.\"</p><p>\"Oh,\" Harry said. He had a feeling the woman was lying, but wasn't sure how because Tori couldn't be telling the truth about her dad living forever. \"What was that language you spoke?\"</p><p>\"French, if I'm not mistaken,\" Gareth answered before the woman could, coming up beside Harry and smiling charmingly. The woman didn't return it.</p><p>\"You speak it?\"</p><p>\"Not very well. It's been a while since I learnt. But let me think…&nbsp;<em>Votre robe est belle.</em>\"</p><p>\"Your accent is terrible,\" she told him, smiling, \"but you said it right at least.\"</p><p>He continued with the French accent as he said, \"I think my French accent is better when I speak English,&nbsp;<em>oui</em>?\"</p><p>\"<em>Non,</em>\" the woman said, laughing. \"That's terrible, sir.\"</p><p>\"Ah, well. A man can try. I'm Gareth, by the way,\" he introduced, holding out his hand. She shook it.</p><p>\"Jennifer. Is this your son?\" she asked, gesturing to Harry.</p><p>\"No, I'm a friend of his godfather. That would be the grumpy fellow in black standing by the keychains.\"</p><p>Godfather was the lie they always used when out and about. Harry knew it wasn't true, but he liked to pretend it was because his real godfather was in a specially built prison for part-human creatures, imprisoned for betraying the Potters to Voldemort.</p><p>\"Why's your godfather grumpy?\" Tori asked Harry.</p><p>\"He's not, that's just his normal face. His grumpy face looks more like this.\" He attempted to imitate one of Snape's scowls, but smiled instead when Tori laughed. He put back the book he'd been looking at—accurate or not, the pictures weren't good enough for him—and instead picked up one about butterflies. \"Are you French?\"</p><p>\"No, but Jennifer used to live in France and so did my mum and dad, and we have a holiday home there so we all speak French. We've got ones in Italy and Greece, too, but I'm not so good at them.\"</p><p>\"Wow, you must be really rich. Is Jennifer your godmother?\"</p><p>Tori shook her head. \"She's my gov'ness.\"</p><p>\"What's a gov'ness?\"</p><p>\"It's like a babysitter only they live in your house and teach you stuff and help look after you and stuff.\"</p><p>\"Don't your mum and dad look after you?\" Harry asked curiously.</p><p>\"Yeah, but when they're busy or at—\" She cut herself off, glancing at Jennifer.</p><p>\"At work?\"</p><p>Tori looked back to him. \"Yeah, at work. What's your name? Mine's Victoria but everyone calls me Tori, except when I'm in trouble.\"</p><p>\"I'm Harry.\" There was an awkward pause between them, each struggling to find something to discuss. Gareth and Jennifer were talking animatedly, clearly getting along, and Snape was scowling at everyone in the vicinity. Eventually Harry gestured to the stuffed animal dangling from Tori's hand and asked, \"Do you like tigers?\"</p><p>Tori lifted the stuffed animal and hugged it. \"Yeah, they're my favourite. I've already got four tigers at home, but I want another one.\"</p><p>Five stuffed animals seemed a bit excessive to Harry. He'd had a look through the ones for sale, but there were no butterflies and he figured that seven was a bit old to be getting stuffed animals anyway. People would think he was a baby, so his Bedtime Bear would suffice.</p><p>They stayed together for a little while as they looked around the gift shop until Snape finally had enough and demanded they leave. Harry bought the book on butterflies while Tori stuck with her tiger. Outside the museum, they started to say goodbye only to realise they were all going in the same direction and even taking the same train at the underground. Only when they all got off at Leicester Square station did Gareth ask Jennifer, \"You wouldn't be headed for the Leaky Cauldron by any chance?\"</p><p>They were, so they stayed together all the way to the pub. Jennifer asked Harry his age and, when he told her what day it was, she wished him a happy birthday and added, \"You'll be in the same year as Tori when you get to Hogwarts then; she turned seven last December. I assume you're going to Hogwarts, that is.\"</p><p>\"Yeah!\" Harry half-yelled defensively. \"I'm a wizard.\"</p><p>She smiled apologetically. \"I didn't doubt that, I just wasn't sure if you'd be going to a different school.\"</p><p>That mollified him. \"No, my mum and dad went to Hogwarts, so I am too, and Severus and Gareth are teachers there.\"</p><p>\"I might not go to Hogwarts,\" Tori said. \"I might go to Beauxbatons like Jennifer did.\"</p><p>Harry was shocked. \"But Hogwarts is the best school in the whole world! I've never even heard of Beauxbatons.\"</p><p>\"It's in France, and you don't know Hogwarts is the best if you've never been to it&nbsp;<em>or</em>&nbsp;Beauxbatons.\"</p><p>\"She's got a point there,\" Gareth said, cutting off Harry who'd started to defend Hogwarts on principle. He looked at Gareth in shock.</p><p>\"But you work at Hogwarts. Doesn't that mean you think it's the best?\"</p><p>\"It just means that's where I could get a job. I've spent time at Beauxbatons; it's a nice place. Very beautiful.\"</p><p>\"When have you spent time at Beauxbatons?\" Jennifer asked.</p><p>\"After I finished school. I did some extended study there.\"</p><p>\"Ah!\" Jennifer said with a grin. \"Now that's something Hogwarts doesn't have, for all that you like to claim you're the best in Europe.\"</p><p>\"<em>I've</em>&nbsp;never claimed we're the best,\" Gareth said with a laugh.</p><p>\"We are… lacking… in certain areas,\" Snape agreed. Harry was shocked by them both.</p><p>\"But I thought Hogwarts IS the best!\"</p><p>\"We're the best at some things,\" Snape told him. \"Our Transfiguration and Charms departments are unparalleled, and we do produce are large number of highly successful graduates, but there's room for improvement.\"</p><p>\"But I thought it was the best at everything,\" Harry persisted, stunned by the idea that the school they worked at, the school his parents had attended, was now being talked about in such a way.</p><p>\"Beauxbatons is the best at everything,\" Tori said proudly. \"Isn't it, Jennifer?\"</p><p>\"I'm afraid not, Tori. As Mr Snape said, Hogwarts does have the best Transfiguration and Charms departments. The Potions teacher of my day wasn't very good, either, but I think they've got a new one.\"</p><p>Tori huffed. \"I'm going to ask my daddy which school he thinks is best. He knows lots of stuff.\"</p><p>They reached the Leaky Cauldron then and parted ways. Jennifer and Tori used the fireplace to Floo out first. Gareth tapped two fingers to his head in mock salute as he said goodbye to Harry and Snape and also Flooed back to his own home. But before Snape could Apparate Harry away a large man with matted hair and whiskers approached them. He was dirty and smelly and had a smile that made Harry edge behind Snape's legs.</p><p>\"Snape,\" the man greeted in a growly voice. Snape turned to him, hand going to the pocket where Harry knew he kept his wand. He didn't look pleased to see the man.</p><p>\"Greyback.\"</p><p>\"Didn't know you had a littl'un, Snape.\"</p><p>\"I don't,\" Snape said stiffly. \"I'm just watching him for a few days. Excuse us.\"</p><p>\"He's scary,\" Harry whispered to Snape as they headed for the Cauldron's Apparition room, where people could come and go without worry that they'd get in the way of the pub's patrons.</p><p>\"He's a very dangerous monster,\" Snape said back just as quietly. \"If you ever meet him again, get as far away as possible.\"</p><p>Harry nodded vigorously; he didn't need telling that twice.</p><p>Snape Apparated him back to Spinner's End and they got fish and chips from the takeaway for dinner, had cake for afters, then Snape insisted Harry have a bath before he could play until bedtime. He only kicked up a slight fuss when that came, tired but unwilling to admit it and wanting to play longer with his Lego. He tried to argue that being seven meant his bedtime should be later—or never—but Snape wasn't moved. Harry pouted and dragged his feet as he headed up, grumbled about brushing his teeth and got into bed, but within minutes of snuggling down he was fast asleep.</p><hr><p>Harry spent just over another week at Spinner's End. Most of it was spent playing with Lego Hogwarts, but he also helped brew a couple of simple potions. On the last day they went out to the fields and Snape showed him some new spells and let him try some himself. To his delight, when he attempted the Lumos Spell he managed more than just sparks for the first time and held up the glowing wand. It wasn't very bright and it flickered unsteadily, but it was there.</p><p>\"I did it! Look Dad, I did it!\"</p><p>Snape froze. Harry frowned, confused, then realised what he'd just said and flushed, lowering the wand and staring at it as the light flickered out. \"I-I didn't mean—'m sorry, I don't know why I said that.\"</p><p>Snape swallowed. \"I… that is… it's fine, Harry.\" He paused, wet his lips, and asked, \"Do, uh… is that… is that how you see me?\"</p><p>Harry shrugged. For a long moment neither of them spoke. Harry didn't know what to say and when he glanced up it occurred to him that maybe Snape didn't either. It would explain why he stood there looking stumped and a little afraid. As Harry had been the one to say something stupid, he figured it was up to him to sort it out.</p><p>\"I am sorry. I know you're not my dad and you don't want to be, and I promise I won't say it again.\" It suddenly occurred to him that this might put Snape off bringing him to Spinner's End every summer, afraid that Harry would start really thinking he was his dad, so he hurriedly added, \"I really mean it so please don't make me stay with my aunt and uncle every summer.\"</p><p>Snape relaxed ever so slightly at that. \"I'm not going to do that, Harry. I promise you, you'll always be welcome at my home.\"</p><p>Harry smiled gratefully, but it didn't quite reach his eyes and he handed back the wand. \"Are you mad at me?\" he asked as Snape took it. \"For calling you that?\"</p><p>\"No. I was just surprised. We should get back.\"</p><p>Harry nodded and they walked in silence together, but the trip back to Spinner's End was an hour's walk and the silence became uncomfortable quickly. Harry had never felt that way around Snape before and he didn't like it, so after twenty minutes, desperate to make things how they were before, he asked, \"Can I take Hogwarts back to Little Whinging with me?\"</p><p>He was pretty sure Snape would say no—the Lego castle was big and would be awkward to move without taking apart, which he was unwilling to do—but it would give him an excuse to argue and pretend to sulk. Pretend, because even if the castle could be moved he wasn't sure he wanted it at Privet Drive, where Dudley might break it down and steal pieces for his own Lego sets.</p><p>To his surprise, Snape didn't immediately refuse. \"I did wonder if you'd ask that. It's not an inherently magical toy and it would be a shame for it to collect dust in my house for most of the year.\"</p><p>\"Really? You'd actually let me?\"</p><p>Snape's mouth tightened and he didn't look down at Harry. \"There isn't really space for it in my house. Even in the living room, it takes up a great deal of room. It would be better suited at your aunt's. Moving it would be difficult, but I may be able to shrink it without it coming apart.\"</p><p>Harry hadn't thought of that and now that it was actually a possibility, he quite liked the thought. There was still the problem of Dudley, however, which he mentioned to Snape. The man considered it for a minute.</p><p>\"I could enchant it,\" he suggested eventually. \"Either with Muggle repellant, a jinx, or charming the pieces together. That would mean you couldn't take it apart yourself.\"</p><p>\"Even the moving bits?\"</p><p>\"No, they would still move.\"</p><p>\"Okay. I think that would be good. I don't want to accidentally break it either. I don't&nbsp;<em>ever</em>&nbsp;want to take it apart. But what about the people? I don't want them stuck together.\"</p><p>\"I can enchant them separately, perhaps to prick the fingers of any Muggle that tries to touch them.\"</p><p>\"Is that allowed?\" Harry asked sceptically. \"I thought you can't do magic on Muggles.\"</p><p>\"Strictly speaking, I wouldn't be. I would be enchanting an object for a magical child. If your Muggle family happened to interfere with that…\" He shrugged. \"I can't be held accountable for their actions.\"</p><p>Harry grinned and Snape gave him a slight smile back, which for him was practically the equivalent of a normal person's grin, and the awkwardness of earlier was gone. When they got back to Spinner's End he bugged Snape to start enchanting the castle immediately, then hovered around him as he did it until Snape snapped at him to go pack his bags for the morning. He did half of it before getting distracted by his&nbsp;<em>Famous Figurines</em>. They were far too magical to take back to Little Whinging, so he decided he needed to play with them as much as possible now before he left in the morning.</p><p>It was a warm summer, even late into the night, and that evening Harry and Snape sat out in the small garden with mugs of cool milk and coffee, respectively. The garden was neatly trimmed but lacking any plant-life besides the grass, a few bushes, and a single apple tree that never produced any fruit. Being at Hogwarts most of the year, Snape didn't have the time for tending a proper garden. There were no outdoor toys, but Harry didn't mind as there was a playpark a few minutes' walk from the house and Snape would take him a couple of times a week.</p><p>It was a clear night, the stars and full moon easily visible, and Harry pointed up to them. \"We learned about stars in my science class.\"</p><p>\"What did you learn about them?\"</p><p>\"That they're super big—even bigger than the whole world—and really, really far away. Even further than Australia, which is all the way on the other side of the world, and they only look small because they're so far away. We also learned that the sun is actually a star, but we call it the sun because the people from a long time ago didn't know it was a star when they named it.\"</p><p>\"That—\" Snape began, then broke off, back straightening, expression alert as he set his coffee down on the small garden table. Harry sat up straighter too, alarmed.</p><p>\"What's wrong?\"</p><p>Snape shushed him, cocking his head as he listened hard, hand drawing his wand from his pocket. For several long moments they were silent. Harry tried to listen, but all he could hear was crickets and the slight rustle of a breeze through the apple tree. Snape must have heard nothing either, for he relaxed a little and set his wand down, but said, \"Drink up. It's time for bed.\"</p><p>Still a little on edge by Snape's actions, Harry did as told without argument, but as he lifted the glass to his mouth there was a growl from the end of the garden. Snape was on his feet in an instance.</p><p>\"Ins-\"</p><p>A great big wolf leapt out of the bushes at the end of the garden and Harry shrieked. Snape darted between him and the wolf, wand raised and shouting a spell, but it was already on them and Snape went down with a scream, wand falling from his fingers and curse fizzling out harmlessly without even touching the wolf.</p><p>Harry's chair was knocked aside and he fell out of it, crawling away even as something warm and wet splashed across his left side. He turned to look and cried out at the sight of the wolf tearing into Snape's throat, feeling his trousers grow wet with urine. He grabbed the dropped wand and scrambled to his feet, pointing it at the creature as it lifted its head and looked towards him, blood dripping from its jaws, vicious teeth bared in a snarl.</p><p>Snape twitched, the skin of his face nearly luminescent under the glow of the moon, mouth open but making only weak gargling noises as blood poured out of his neck. It soaked through his robes, too, where the wolf's claws had shredded his chest.</p><p>Harry couldn't remember any spells. Snape had taught him shield charms at the beginning of the summer and, as he always did, he'd tested and tested Harry on the incantation and wand movement, making him memorise every new thing that he learnt, but right now Harry couldn't remember anything. His mind was completely blank.</p><p>When the wolf leapt, all he could do was scream and thrust the wand out before him, screwing his eyes shut to the coming death. He smelt blood and felt hot breath and wet saliva on his skin, but teeth never latched onto him. Instead there was a painful yelp and gagging noises and the wand left his hand. He opened his eyes to see the wolf back away, the wand jammed in its throat, choking and staggering as it pawed at its snout trying to get it out.</p><p>For a moment Harry just stared, then his senses kicked in and he ran for the kitchen door, slamming it shut behind him and fumbling to twist the key in the lock. He stood at it, staring through the glass partition in the top half at the wolf still staggering around outside. He glanced at Snape, but the man wasn't even gargling now, lying motionless in the blood-soaked grass. Swallowing thickly Harry looked back to the wolf, almost daring to think it would choke and die and he'd be safe, but the wolf vomited, forcibly ejecting the wand, and after coughing and gagging a few more times it turned towards the door, and flung itself at it, making Harry lurch back so fast he fell on his butt.</p><p>He hurried up again, running through the living room and snatching down the pot of Floo powder above the fireplace, spilling half of it in the process. The fireplace was too small to actually Floo through, but it was connected to the network and could be used for calls. Harry had never done it before, but he'd seen Snape do it and he tipped the whole pot of powder into the empty grate. It instantly burst into bright green flames that made him step back, then he knelt by it and stuck his head in the fire. For an instant his mind blanked and he said nothing, but the smash of glass from the kitchen frightened his brain to life and he yelled out, \"Hogwarts!\"</p><p>His head spun so much he thought he'd be sick, then it stopped and he found himself staring out into a cosy little sitting room. An armchair was in pride of place before the fire, in which lounged a tall bearded man who looked thoroughly startled to see Harry. Harry didn't wait for him to get over it.</p><p>\"Help! There's a monster, it killed Severus, it's going to—\"</p><p>Sharp, hot pain lanced across his back and he was dragged out of the fireplace. He lashed out wildly, hit something soft with his left arm and something hard with his right. He grabbed the hard thing and pulled, realising it was Lego Hogwarts only as it toppled over. One of the towers caught the wolf, who yelped, and Harry rolled, instinctively trying to face what was attacking him despite the agony in his back.</p><p>He tried to lash out again as the wolf bore down on him, but his arms were weak now and he barely managed to lightly whack it across the snout. It responded in kind, a paw as big as Harry's head striking him across the face, and he barely felt claws slash his cheek open before the force of the blow knocked him unconscious.</p>\n  </div>"
},{
  "_id": {
    "$oid": "636bbd8b7889145d0d5a2599"
  },
  "title": "A Dog, A Bus, and A Letter",
  "content": "<div class=\"userstuff module\" role=\"article\">\n    <h3 class=\"landmark heading\" id=\"work\">Chapter Text</h3>\n    <p>Chapter Two: A Dog, A Bus and A Letter</p>\n<p>Harry sunk his hands into the hot, soapy water, fingers wrapping around the heated metal of a fork. Pulling it upward, he rubbed at the prongs aggressively with a sponge, jaw clenched as he tried in vain to block out the words being spoken behind him.</p>\n<p>“Getting ready for school to start, Dudley-Dear?” Aunt Marge asked, her voice loud and brash and like a bolt of lightning to Harry, setting his nerves on fire, his body thrumming with irritation. “What teacher has he got? A good one, I hope. Nothing like the sort he had at the beginning of term last year. She was absolutely wretched! You won't be letting the teachers bully you around like that this year, of course, Dudley?”</p>\n<p>The response was smug, spoken through a mouthful of chocolate cake that made his voice sound thick, congested. “Absolutely not, Aunt Marge.”</p>\n<p>She made a hum of approval, and Harry curled his hands into a fist at the sound. </p>\n<p>The woman was dreadful in every sense of the word, refusing to allow Harry out of her sight but unable to keep from ignoring him. Not a span of ten minutes could pass before she would turn to him, lips skewed into a frown, disdain evident in her beady eyes. Her words were cruel- cutting- and every syllable that left her tongue tied another knot in his frayed composure, permanent cuts indented on the inside of his cheek from biting down on them so hard and often.</p>\n<p>Five days had passed since he had seen Tom in the woods. He had thought for certain that he would never return home that afternoon with the tree branch wound tightly over his legs, Tom bruising his arm with his tight grip. He had been surprised when Tom left him, disappearing with a crack, the feel of soft, pliable lips still lingering over the scar on Harry's head. His parting words still echoed in his ears, reverberating against his skull: 'I'll be in touch.'</p>\n<p>They were a promise, a threat. But why hadn't Tom just taken Harry with him? He had claimed he wanted to protect him, that Harry would never be able to leave him. And yet, Tom had left him. Easily. Swiftly. Vanishing in a flourish of a cloak, a crackle of heated air.</p>\n<p>And the roots unwound, sinking back into the earth. By the time he had found his wand- tossed among the strewn about sticks and overgrown brushes- and ran home, Marge had arrived for her week long stay. She had whacked him with her walking stick several times for his tardiness, calling him rude, pathetic and a scoundrel all the while. When he retreated into his cupboard below the stairs, knees knocking into his chin as he fell to the cot, he heard Marge congratulate Vernon on finally putting his foot down. 'It's enough that you opened your home to him, took him in when no one else wanted him. You were spoiling him by giving him a room- he wasn't very grateful for it.'</p>\n<p>Five days of Marge had left him worn, adding onto the already mounting well of emotions. The anxiety and paranoia that left him looking over his shoulder, examining every shadowed corner with impossible scrutiny. Looking to the places beyond the glass of a window that were too dark, too distorted by the light from within a home to see properly. If Tom Riddle had been hidden behind the bushes, he hadn't seen him. Though it did little to ease his mind. He was fairly certain he could keep a well enough eye on Harry without having to lurk around the streets of Privet Drive.</p>\n<p>“What's wrong with you boy?!” an unkind voice bellowed, and he startled, releasing the fork that he had been cleaning for several minutes. “Can't even figure out how to clean some silverware?”</p>\n<p>His jaw clenched as Dudley snickered at the quip, Uncle Vernon leveling a stern glare in Harry's direction. “St. Brutus is far more fond of corporal punishments than they are in chores, though perhaps I should call the Headmaster about the oversight.”</p>\n<p>“While you're at it tell them to be more forthcoming with the cane on the boy. Must not be using it on him enough.”</p>\n<p>Harry twisted sharply away from the conversation, the muscles in his jaw clenched, aching with the pressure of the tight clamp. Settling the damning fork aside, he reached into the sink for a plate. </p>\n<p>“It's lovely that you've got some place to ship him off to for the school year but I still insist that you should have sent him to an orphanage. No sense taking on the burden for someone so unappreciative,” Aunt Marge drawled.</p>\n<p>Fingernails dug into the porous sponge as he scrubbed at the plate a bit too harshly, a muscle in his jaw twitching in the strain. Funny that they spoke of an orphanage as if it were some sort of hell, a circle even lower and more vile than the one he had already been imprisoned in. Surely, a state home would be far more preferable to sleeping in a cupboard, his knees bent to accommodate for the considerable amount of growing he had done since he was eleven. Far more preferable to eating only the scraps that were left behind, portions so meager it was more a taunt than an act of kindness. Surely, an orphanage would not be so bad.</p>\n<p>'Tom had hated it though,' he thought, the idea enough to still him, his eyes raising from the dishes he was washing to the window above the sink, the sky newly darkened as the day faded to night. Had Tom- Voldemort, not Tom, he's Voldemort- really even lived in an orphanage? Or had it all been a lie? A carefully constructed ruse in an attempt to trick Harry? Relating to him on such a raw, intimate way- a way that no one else had managed as they did not know what it was like to grow up without a loving family, to be 'the boy' and nothing more. </p>\n<p>Who had mentioned being an orphan first? Had it been Harry, with To-Voldemort latching onto the confession and seeing the opportunity that it presented, eyes shining with greed and want? Or had Voldemort mentioned it first, a lucky guess or perhaps a grain of truth buried within a mountain of lies?</p>\n<p>After a moment, he shook the thought from his head. There was something disconcerting about thinking of Voldemort as anything other than the behemoth, the terrible monster he had become. It seemed perverse that at one point in time, he had been like Harry. A thirteen year old boy. A student at Hogwarts.</p>\n<p>That he had been a baby, would have cried and wailed for the attention of a mother that may or may not have been there to dote on him. What sort of mother would give birth to a child like him? What man had fathered him?</p>\n<p>It was too normal. Too human. </p>\n<p>“Boy!” </p>\n<p>It was Uncle Vernon this time who roared, and Harry craned his neck around to see four sets of eyes looking to him. </p>\n<p>“Marge is talking to you and you're being incredibly rude to her!” His face was ruddy, his own frustration with Harry mottling his complexion into an ugly palette of reds and violets. </p>\n<p>“I'm sorry-” he began to say, struggling to sound appropriately apologetic. </p>\n<p>But his words were cut off, Marge's nostrils flaring in disgust. “That's to be expected I suppose. Look at his genes- no offense to you, of course, Petunia, you're lovely. But in all honestly that sister of yours would have done well to keep her legs closed and away from that degenerate Potter.”</p>\n<p>The plate slipped from Harry's hand, shattering as it fell to the floor. It was loud, a piercing sound, and he was dimly aware of the shards of porcelain which splattered at his feet. Marge rose, her lips forming an 'o' in the beginning of a taunt that never left her mouth as Harry roared loudly, “Don't you dare talk about my mother and father that way!” His voice cracked, the young, prepubescent warble of a not quite man.</p>\n<p>Marge stepped forward, shoving her chair to the side with a screech as the legs scraped along wooden floors. She extended an arm outward, a plump finger poking at the air before him accusingly. “I'll talk about your mother and father however I want to! They were no good- that mother of yours was a foul and dirty thing that would give it to anyone who asked politely enough and your father-”</p>\n<p>“ENOUGH!” he shouted, his throat aching at the intensity. His hands were balled at his side, fingernails carving half moon shaped cuts into his soft palm. He was shaking with rage, trembling in a way that made him feel anxious, like his energy could not be contained within the structure of his bones and skin. He could feel the floor shake as several other chairs scraped along it, as Marge pounded towards him. Saw her lips twist and contort and he knew that the kitchen was a cacophony of noise and yells.</p>\n<p>Yet, he could hear none of it. The only thing he could hear was a high-pitched whistle, like steam escaping a forgotten kettle. And the voice whispering in the back of his skull.</p>\n<p>'Show her, Harry. Show her why she should never talk to you like that. Show her just how different you and your parents are. How special you are.'</p>\n<p>There was a clatter behind him, dishes bursting with an unseen force. Bulbous wells of wine glasses shattering as they sat drying on the counter, water glasses and plates following in like fashion. And with a hiss, they flew into the air, jettisoning beyond Harry and at Marge with such great speed that he could hardly see them slice through her exposed skin before they fell to the floor, sticky with blood.</p>\n<p>Anger left him, air escaping a balloon, and his eyes widened in horror as the tip of her extended index finger, sliced at the second knuckle, fell a half second later.</p>\n<p>It was as if the world had been put on pause, mute, only for it to sped up, noise and color and reality sinking in all at once. </p>\n<p>There was blood everywhere, deep cuts along Marge's haggard face only adding to the carnage of her severed finger. She was bellowing in rage and in pain, pausing in her tirade to scream as her uninjured hand clutched feebly at her wrist. Petunia was squealing, her long, bony fingers wound nervously in her blonde hair as Dudley asked over and over again what was happening. Only Vernon seemed capable of action, roaring obscenities as his face turned a brilliant shade of crimson. He took long strides across the kitchen to Harry, who startled at him before taking off in a run.</p>\n<p>In his entire thirteen years of existence, he had never been so thankful to be so fast and wily, slipping just out of reach of the man and darting down the hall, his heart thudding in his chest. “GET BACK HERE!” Vernon roared behind him, his gruff voice booming over the chaos.</p>\n<p>But Harry was out the door in seconds, leaving behind the blood and the screaming as he ran aimlessly down the street, not sure of where he was headed but simply knowing he needed to get as far away as possible.</p>\n<p>He had made it two blocks before he came to a stop, bent at the waist and his hands gripping onto his knees. His legs were shaking, his breath coming out in raspy, uneven spurts. He stood like that for some time, attempting to steady his breathing and thinking of what to do, of what had happened.</p>\n<p>What had happened?</p>\n<p>He was no stranger to accidental bursts of magic, though they were few and far between since attending Hogwarts. But never before had it been so...malicious. It had felt as if he was submerged in ice cold water, his blood freezing in his veins as something else had taken over, a hand over his and something sinister within his mind that wanted to hurt.</p>\n<p>Something sinister that had enjoyed hurting her, that enjoyed showing that horrid woman just what he could do.</p>\n<p>He swallowed thickly, shoving the thoughts away for now. Further examination could occur later, when his thoughts were less jumbled and he wasn't standing outside on the street, the skies already darkened. The night was cold, and he felt his flesh prickle underneath his lightweight jumper, wrapping his arms around his torso for some warmth. </p>\n<p>What was he to do? Where was he to go? He couldn't very well turn back after that. </p>\n<p>His thoughts were interrupted by the sound of whimpering, the distinct whine of a dog. </p>\n<p>He twisted where he stood, stumbling at the sight of an impossibly large dog in the center of the road. The thing was massive, despite looking quite underfed, matted and mangled black fur covering what he was sure would be visible ribs. It stepped forward, one huge paw that looked as if it had been chewed at, patches of fur missing, coming down on the pavement, and Harry took an involuntary step backwards.</p>\n<p>He stumbled, tripping over the lip of the sidewalk. His head smacked against the gravel bed of a path that lead to the front porch of a home, his arms splaying outwards. A low groan slipped from between his lips as he slowly sat back up, rubbing a hand over a tender spot of his scalp. Wonderful.</p>\n<p>Just what this evening needed.</p>\n<p>A concussion. </p>\n<p>Brushing dirt and small, embedded pieces of gravel from his jeans, he stood, just in time to jump out of the way of a careening vehicle, one which seemed to appear out of thin air. Tires screeched harshly over the road, one thumping over the sidewalk as what appeared to be a triple-decker bus came to a halting stop, forced at an angle by the uneven tires. </p>\n<p>A dog barked, massive paws thudding into the ground.</p>\n<p>The bus- a brilliant shade of violet that Harry had never before seen on transport- let out a hiss, doors squeaking open. A thin faced, mousy looking man poked his head out, looking about him before settling his eyes on Harry. </p>\n<p>When Harry made no motion to move forward, he said, “Well? What're ya waiting for? An invitation?”</p>\n<p>Tentatively, Harry took a step forward, peering through the curtained windows. He thought he could see what appeared to be beds in the interior of the bus. How curious, he thought, knowing that it surely had to have belonged to the Wizard World.</p>\n<p>How muggle of them, appropriating a bus.</p>\n<p>“Are...are you stopping at...the Leaky Cauldron?” he asked, licking his lips. It was the only establishment that came to mind, one that offered both a warm meal and lodging.</p>\n<p>His stomach quivered at that. He hadn't had the opportunity to eat all. The Dursleys insisted he wait until after they finished eating before he was allowed to have anything at all, and their dinner had come to a rather unfortunate end. </p>\n<p>“We can go whereva ya need,” the man said, extending a thin hand outward. “Eleven sickles. Thirteen for a hot chocolate.”</p>\n<p>Harry's mouth went dry. In all his haste to leave, he hadn't grabbed any of his belongings. He had only the clothes on his back and the wand in his pocket. “I-er,” he mumbled, slipping his hands uselessly into his pockets. His fingers met something hard and cold, and with wide and grateful eyes, he pulled out a handful of coins that had not been there before. He wasn't certain how they managed to sit in his pants without his knowledge- several galleons and about seventeen sickles was not exactly a light amount- but he had never been more thankful for his stroke of luck than in that moment.</p>\n<p>Counting out thirteen sickles, he handed them over before slipping the rest of the coins back in his pockets.</p>\n<p>“I'm Stan Shunpike,” the man said as he stepped aside, his lips moving noiselessly as he counted the change. “You?”</p>\n<p>Harry grimaced. “Neville. Neville Longbottom,” he lied, entering the bus without any a thought to Marge and her severed finger, or the stray dog that had all but disappeared.</p>\n<p>-xXx-</p>\n<p>The Leaky Cauldron was busy, lively witches and wizards with reddened faces laughing, huddled together in earnest conversation. The bar was so crowded that Harry could hardly see the barkeep scurrying around between all the patrons, all the surrounding tables full with plates of hearty dishes- shepherd's pie, roast beef, and steaming potatoes- and he stood in the doorway awkwardly, feeling quite out of place. </p>\n<p>His shirt stuck to him from where his hot chocolate had splashed onto him during a particularly sharp and frightening maneuver the Knight Bus had taken. His hair was still tousled from when he had been sent flying through the interior. He was immediately self conscious, running a hand through his hair and wondering what to do.</p>\n<p>Surely, he had enough for a night stay in one of the rooms, and hopefully even a plate of food, his stomach growling at all the tempting smells surrounding him. He could figure out the rest later. Of what to do. Of how much worrying he should do. </p>\n<p>Accidental or not, he had used magic outside of school.</p>\n<p>Had harmed a muggle.</p>\n<p>And even worse, like a common criminal, he fled the crime scene.</p>\n<p>He frowned. Not as if it wasn't his first time fleeing such a thing.</p>\n<p>“Ah, Mr. Potter! I had hoped I'd find you here!”</p>\n<p>Harry startled at the loud declaration, turning to find a rather plump wizard coming towards him, a large congenial smile warming his face. His hair was thin, graying, and his arms were extending outward as if he might wrap them around Harry in a hug once he got close enough.</p>\n<p>Thankfully, he had stopped just short of that, letting one arm fall to his side while the other reached out, expectantly. “Minister for Magic, Cornelius Fudge. It is a pleasure to meet your acquaintance,” he greeted, shaking Harry's hand vigorously. </p>\n<p>Harry felt his heart plummet as he took his own hand back, curling it against his chest. There would be no time to figure out the rest later, it seemed. No putting of anything off until he had some food in his belly or a proper rest on a bed that he could fully extend out on without having to contort himself. </p>\n<p>He might have wondered just how much trouble he was in, if he would be expelled from Beauxbatons before he even got to attend, but he was too distracted by the merry tone of Fudge's voice as he placed a hand on Harry's shoulder, leading him towards a table by the fireplace.</p>\n<p>“I must say, we're certainly relieved to see you're alright. When we had heard about the Auror report, we had assumed the worst-” he said, causing Harry to skew his brows in thought.</p>\n<p>“We?” he asked.</p>\n<p>As if to answer the question, Fudge came to a stop, pushing Harry down into a chair opposite none other than Albus Dumbledore.</p>\n<p>The older wizard smiled, leaning forward in his chair. “Hello, Harry. Glad to see you're well,” he said, his blue eyes noticeably absent of their familiar twinkle. </p>\n<p>“You are well, right? You don't need us to find you a healer?” Fudge cut in as he sat in a chair between Dumbledore an Harry. He exhaled in relief when Harry shook his head, muttering that he was fine. </p>\n<p>A moment passed in which nothing was said, Fudge rubbing his eyes as though he were exhausted despite it only being about nine in the evening; Dumbledore gazing at Harry in that way that made him feel as if he were invisible, vulnerable and stripped and raw.</p>\n<p>He shifted in his seat.</p>\n<p>Coughed.</p>\n<p>“Is this about what happened to Aunt Marge?” he asked. Best to get it over with. No pleasantries or  kindness. 'We're sorry, our hands are tired. Magic in front of muggles and by underage wizards is strictly prohibited. You're being expelled. Hand over your wand, we'll bring you back to the Dursley's. Perhaps if your lucky, they'll let you stay in that roomy closet and not stick you in the one with the water heater for punishment.'</p>\n<p>He was surprised when Fudge shook his head. “Marjorie Dursley has been healed and her memory erased by the Accidental Magic Reversal Squad. Hardly the least of our concerns, really, what with everything that happened tonight,” he said. </p>\n<p>“Right,” Harry said, trying to hide his confusion. He was beginning to get the distinct impression that his version of the night's events might have been a bit different from the version Fudge had. </p>\n<p>“The Aurors were called in by the use of dark magic, you see, and when they arrived, they interviewed your family. You gave us quite a fright, running off like that! But that was quick thinking, summoning the Knight Bus. I'm sure that scared Black off right and well!” Fudge said, chuckling nervously as if he had something funny. He didn't.</p>\n<p>Harry frowned. “Black?”</p>\n<p>“The Wizard who attacked you and your family tonight. That is his name,” Dumbledore explained, his eyes narrowing from behind the half-moon spectacles. “I understand you don't get the Daily Prophet delivered over the summer, but you might have heard about him through muggle reports. He escaped some time ago, from Azkaban-”</p>\n<p>Before Dumbledore could continue, Fudge interrupted, leaning forward as if to bodily get in Dumbledore's way. “We've been working tirelessly at the Ministry to find him, I assure you. Aurors working around the clock, top researchers trying to figure out how exactly he did manage to escape in the first place. I myself wanted to make certain that we had several Aurors maintain a watch outside your home just in case this exact scenario should occur. But the director of the Auror Department wouldn't hear it, said we didn't have enough men,” he said, the word disingenuous coming to the forefront of Harry's mind unbidden. Fudge chuckled inappropriately again. “She'll certainly be hearing about how her oversight nearly found our Harry Potter in grave danger.”</p>\n<p>Dumbledore flicked his eyes over to fudge, opening his mouth before closing it, as if thinking better of what he had to say. </p>\n<p>Harry swallowed a lump in his throat. “I'm fine. Really. Just a little hungry and tired now that it's all over,” he said, choosing his vague words carefully. It was a great deal of information- confusing information, that didn't quite match up with his own memory and it made his head ache to even begin to think of how both truths could exist simultaneously. He had no idea who Black was or why he would attack him, no guess to what an Azkaban even was. </p>\n<p>And yet, he knew better than to ask. Afraid that doing so might dissolve whatever carefully fabricated story that Minister had discovered at that house on Privet Drive. He didn't know what was going on, but he somehow knew that maintaining the lie was the only thing between him and expulsion.</p>\n<p>If they knew the truth- that Harry was not pursued by anyone, that he was running away from himself and his own mistakes instead of some escaped wizard. That no one but Harry and him alone had injured a muggle. If they knew any of it, they would ask for his wand without a moment of hesitation.</p>\n<p>He hated to lie, least of all to Dumbledore, but he couldn't risk expulsion. Couldn't risk being sent back to the Dursley's where punches and kicks and empty plates were readily offered to him. Where he was locked within a closet with hardly any food in his belly and bruised ribs from when Uncle Vernon lost his temper when Harry didn't retrieve the mail fast enough or didn't clean to his liking. </p>\n<p>It was a matter of survival.</p>\n<p>He wouldn't live another month of the Dursleys.</p>\n<p>This, he knew too with certainty. </p>\n<p>“Let's get you some food then,” Fudge said, rising from his seat and disappearing into the crowd. </p>\n<p>“You have two nights before school commences. You can stay here, until then. I am told a staff member has already procured a room for you, you can fetch the key from Tom at the bar when you're ready. Your stuff, as well as that lovely owl of yours have all been dropped off and are waiting for you upstairs. You've been accepted into Beauxbatons, yes?” Dumbledore asked.</p>\n<p>Harry nodded, finding it difficult to not look away when the blue eyes bore into him so painfully. Dumbledore had been the first- if not the only- person Harry thought he could trust, that he could believe with little hesitation when he said he cared for him and wanted the best for him. It felt terrible to lie to him- profusely, it seemed, ever since he had found himself in possession of the damnable diary. Tom's diary.</p>\n<p>He curled his hands into fists at the thought of the other boy.</p>\n<p>The Dark Lord. </p>\n<p>Further proof that Harry was rarely ever good at knowing who to trust.</p>\n<p>Dumbledore sighed, though at what he didn't know, as Harry had become too distracted by the start of a headache, the throbbing pain making his vision bleary. He placed a hand to his temple, wincing as he nodded along to Dumbledore's stories of the French school and the Headmistress, a beautiful if not unique witch named Madame Maxime. </p>\n<p>A plate of food was placed before him, and he hungrily tore into it, feeling his headache subside the more satiated he became. He assured Fudge several more times that he was fine, that Black had not managed any damage during the attack. He asked Dumbledore questions about his new school, asked if there was any chance of Hogwarts reopening.</p>\n<p>“I'm afraid not,” he had answered solemnly. “Not until the cause of Ginny Weasley's death becomes clear to us.”</p>\n<p>Harry opened his mouth, the words he had wanted to say all summer dying on his tongue as his headache returned with such force that stars burst in his vision.</p>\n<p>He clamped his lips, waited for the pain to abate, his right eye blurry, unable to see anything but half formed shadows.</p>\n<p>Dumbledore watched him, scratched his chin in thought.</p>\n<p>“That's too bad,” Harry said after a minute before sinking the tongs of his fork into a piece of chicken.</p>\n<p>Lying was survival, he reminded himself.</p>\n<p>-xXx-</p>\n<p>Harry came to a stop in front of the marked room. Room 4. He ran a hand through his hair, untidying it further than it already was as he slid the key into the lock, twisting it until it clicked.</p>\n<p>He had never before looked so forward to sleep. The night had been exhausting and perplexing and he wanted nothing more than for it to end. He knew there was much to do- he still had yet to even shop for his school supplies- and now he needed to learn about this Azkaban and Sirius Black and how any of it had even tied together so that his own assault on Aunt Marge could be mistaken by Ministry officials.</p>\n<p>He had bid both Dumbledore and Fudge a goodnight, sighing a breath of relief when they allowed him to go. He was safe, at least for the night. With any hope, he wouldn't be returning to the Dursley's until the school year would come to an end.</p>\n<p>He pushed the door open, taking only a step inside before pausing. </p>\n<p>The light hanging from the ceiling in the center of the room was on, casting a warm glow over the scene before him. His trunk was placed at the foot of the bed, just as Dumbledore had promised. Hedwig's empty cage sat on a desk placed beside an open window, the breeze rustling the curtains. But most curious of all was by the small complementary kitchenette, where Tom Riddle stood in front of stove, pulling a steaming kettle off a burner, the coils an angry red.</p>\n<p>He looked up at the intrusion, blinking at Harry before tipping the spout of the kettle over a mug. “I've made us some tea,” he said simply, as if they were old friends. </p>\n<p>Harry spun on his feet, retreating back down the hall as fast as he could. With any hope, Dumbledore or Fudge would still be there, exchanging long farewells within the dining hall. And he could end it. End the torment and the guilt and the lies and the fear that over his shoulder was the young Lord Voldemort. He wouldn't have to tell them, wouldn't have his tongue bound in silence if he could just show them because he was right there, in the flesh, casually making tea in his room.</p>\n<p>“Professor!” he yelled just as he made it to the top of the stairs.</p>\n<p>He shot on arm out, bracing himself against the wall as the world begun to spin rapidly, colors and movements blurring into mottled shapes. The sounds from below- of laughter and conversation and goblets clinking on tables- dimmed, fading as it was replaced by a high-pitched hiss. The sound the Knight Bus made when it came to a halt. The sound of the tea kettle. </p>\n<p>His face was numb, the pain behind his eye so immediately intense that it gave way to nothing, the nerves unable to take much more torment.</p>\n<p>He wavered on his feet. </p>\n<p>Touched a hand to his face, feeling something wet and warm.</p>\n<p>Tears or perhaps blood.</p>\n<p>When he fell backwards, it was into waiting arms.</p>\n<p>-xXx-</p>\n<p>Harry awoke nearly nine hours later. The sky outside the window was blue and bright, and he was greeted by the hooting of Hedwig, her wings rustling through the air as she flew freely about the room. She fluttered down to the bedside table, leaning forward and pecking playfully at his pillow as he twisted around to look at her. </p>\n<p>He smiled, knowing that it was the first time all summer she had been able to stretch her wings, confined to the cage and spare bedroom at the Dursley's, where Harry could only see her once a day to feed her. </p>\n<p>'She doesn't deserve that,' he thought rubbing a hand over his face, stilling when it found the gauze bandage covering his eye. </p>\n<p>He sat up in bed, the events of the previous night rushing to him in quick succession, like the recollection of a nightmare as one sat panting and heaving in sweat soaked sheets. 'Tom was here,' his mind screamed at him, and he looked up from his lap and around the room, his one uncovered eye settling on the figure sitting before him. The dark curls pushed neatly in place as Tom bent over the table, a copy of The Daily Prophet in front of him. </p>\n<p>“Morning,” Tom said, reaching for a cup beside him and bringing it to his lips. When Harry said nothing in return, he settled the cup back onto its saucer, turning to meet his gaze. “Are you feeling well?”</p>\n<p>He might have snorted at that if not for the sheer incredulity of it all. Instead, he asked simply, “You did something to me. And I can't tell anyone about you. Or even think about telling them.” It wasn't a question. It was a statement.</p>\n<p>The edge of Tom's lips quirked, tipping into an smirk as he said, “Very astute.” He turned back to the paper, adding, “A security measure of sorts. A necessary evil I'm afraid. It would be very unsafe if word got out that I'm back, and as much as I hate to cause you pain I had no choice.”</p>\n<p>At this, Harry did snort.</p>\n<p>Tom looked up at him once more, his dark blue eyes wide. “You don't believe me?”</p>\n<p>“You haven't exactly given me reason to,” Harry answered, shuffling out of bed and pawing through the covers, tossing them aside. “Where's my wand?”</p>\n<p>Tom ignored his question. “I'm being quite sincere. I know that may be hard given what occurred between you and the one they call You-Know-Who-” he paused here, a small smirk flitting across his face- “But I urge you to try to keep us separate. I am no more him than you are.”</p>\n<p>Harry ceased his search for his wand, glowering at the older boy as his lips pulled back in a snarl. “No! That's not true because you are him. I don't know what you did or how you did it but you're him just younger and you're nothing like me.” The last few words were spoken through his teeth.</p>\n<p>If Tom was startled by the anger in Harry's words and the vitriol with which he spoke, he didn't show it, only frowning as he said, “I wasn't lying to you. I was doing research, experimenting with things I had no business with, admittedly. I trapped myself- a part of myself- within the diary. What went on after that...” He paused, sighing as he rubbed at his eyes. “It wasn't me. Something happened to my soul and the part that remained in this world was merely a sliver of myself.</p>\n<p>“I don't pretend to believe that Lord Voldemort is no monster. I have read of him. Tried to form a timeline using all the information I gathered to understand what he did with the life he took from me. He may have once called himself Tom Riddle, but I swear that is all we have in common. Something inhuman was stripped of me that night I locked myself in the diary, and that was the only part of me that continued to exist.”</p>\n<p>His words were pleading, a desire- a need- to have Harry believe in them. And for a moment, Harry felt himself soften at the sincerity of them. </p>\n<p>Only for a moment.</p>\n<p>“That's a real beautiful story. Got another one? I could use a laugh,” he sneered, tearing through the drawers of both bedside tables. “Where is my wand?”</p>\n<p>Tom sighed. “You don't have to believe me. I didn't think you would. That's why I had to curse you to silence. You never know whose ears are listening. If word spread that I got out of the diary, he would be after both us. More ardently than he already is, at the very least in your situation.”</p>\n<p>“Why?” Harry asked, feeling his patience wearing thin. “Why would he want me dead anymore than he already does?”</p>\n<p>Tom blinking owlishly. “Because you helped me. You can condemn me all you want, Harry, but you're the one who killed Ginevra that night. Not me,” his words were soft, as if to comfort him even as he accused of something so heinous.</p>\n<p>Harry shook his head, something scratching his throat. “No. You made me. Somehow, you made me.”</p>\n<p>Tom rose from the chair, taking several cautious steps forward until he stood before Harry, still much taller than him despite his recent growth spurt. Tom reached out, fingers brushing against his jaw as Harry jerked away from his touch, flinching as if Tom was fire and acid and all things that would consume and destroy him.</p>\n<p>“You wanted to free me. You trusted me. I made you do no more than you were willing to do.”</p>\n<p>“Get out,” Harry said, his voice low and rough and as threatening as he could manage. He clenched his jaw, the crowns of his teeth grinding so viciously over each other that he thought his entire mouth might shatter into a million fragments of bone and tissue. “Leave me alone.”</p>\n<p>To his immense surprise, Tom nodded, turning away from Harry and gathering a cloak that had been draped over the back of the chair he sat in. “Very well. I'll leave, but only for now. You might not believe me, but it doesn't make my concern for you any less legitimate. I will still keep in touch with you.”</p>\n<p>Turning back to Harry, he tapped a long finger on his cheek bone, just below his right eye. “The patch can't be removed until tomorrow morning, taking it off early will compromise the potions I've treated it with. And do read that newspaper when you get a chance. From what I've read, this Sirius Black seems quite intent on harming you.”</p>\n<p>And with that, he was gone, the door clicking shut as Hedwig hooted at his departure, as if to bid him farewell.</p>\n<p>The headlining article that morning had been about Sirius Black's attack on an unnamed muggle house the previous night. One muggle injured. Alert all authorities immediately if spotted. Do not approach. Dangerous and Mad. Former servant to He-Who-Shall-Not-Be-Named.</p>\n<p>Harry tossed the paper from him, making a frustrated grunt. There were two Lord Voldemorts running about. One who is Tom, and one who is not but also once was. A deranged prisoner was hunting him. Ginny was still dead and he was still the one who did it. He wasn't even sure of his memory of last night and why it conflicted so much with the reports the Ministry made.</p>\n<p>He looked up from the table.</p>\n<p>His wand was just underneath the bed, perhaps kicked under from his hasty search of the blankets.</p>\n<p>-xXx-</p>\n<p>Tom wound his way through the crowd of Diagon Alley, parents dragging their children through the last of their shopping for school, children whining in that frequency that made mothers cluck their tongue. He kept his head bowed low, his hair curling around the edge of the soft cap he wore. It was a bit too hot for such adornments, but the precaution was necessary. If a bit extreme.</p>\n<p>He was certain that nobody alive today would recognize him as the young Lord Voldemort, before his looks and charm had been so heavily distorted by dark magic and rituals. Well, nobody except a certain Headmaster.</p>\n<p>'Former headmaster,' he corrected. </p>\n<p>No, Tom Riddle had surely all but faded away. A handsome, promising young student who never lived up to his potential. Disappeared into obscurity. </p>\n<p>He took a turn down an alley way, the crowd substantially thinner. Substantially less savory. </p>\n<p>He smiled a rare, genuine smile at the thought of Harry. He was a stubborn one. Typical Gryffindor. Headstrong, too emotional for his own good. He supposed it was admiral, how he stood his ground, baring teeth that weren't nearly as pointy or scary as he thought. Like a kitten imitating a lion.</p>\n<p>It was certainly not ideal, starting from square one in earning the boy's trust again. He, like many Gryffindors, could be loyal to a fault once it was earned, but Harry was not the most generous in that department. It did not take a genius or a muggle therapist to see that his tumultuous and abusive home life had made the boy distrustful, doubtful of any adult no matter how kind and trusting they seemed. Tom had spent a great deal of time within his head to know that he was even becoming a bit more shrewd to Dumbledore, avoiding his glances and skirting around questions.</p>\n<p>Lying to him.</p>\n<p>It made him proud, if he were being honest.</p>\n<p>Tom wandered through Knockturn Alley, slowing by shop windows and inclining his head in interest at the displayed trinkets. A witch with a broken nose and glass eye stood only several feet away, calling out to come and see her collection of blood vials.</p>\n<p>'Unicorn! Merfolk! Siren! Virgin! Each only 40 galleons! A right bargain!'</p>\n<p>Tom considered her for a moment. Merfolk blood could certainly be useful, several potions popping in mind that he wouldn't mind having a go at. The Dursley family would be suitable guinea pigs, he thought, a wry grin twisting and marring his features.</p>\n<p>No. He doubted it was even authentic Merfolk blood. Forty galleons was too much a bargain for that.</p>\n<p>Still, the idea of teaching the Dursleys a lesson or two lingered in his mind, and he stepped into the shop, hoping to find something a bit more genuine. </p>\n<p>He shivered at the remembrance of drinking the polyjuice potion, his skin bulging and sagging until he resembled Vernon Dursley, giving the Aurors an account of an event that had not happened. As proud and delighted as he was- watching Harry slice and dice that wretched woman until she resembled raw meat- it would do no good for the authorities to make wind of what had occurred.<br>Sirius Black had proved to be a handy excuse. A bit of memory work here and there, disorienting them until none of them could make heads or tails of whom the true attacker had been. Damaging the property a bit more- exploding a door out of its frame, bursting a window. </p>\n<p>From there, it was only a matter of issuing a few unforgivables to alert the Aurors. A pluck of the hair and tossing the patriarch into the cupboard beneath the stairs- an irony he paused to chuckle at- Tom had assumed the role of Vernon Dursley and told the harrowing tale.</p>\n<p>'That escaped loon came bursting in! Did something to my family- confounded them! Then he went after the boy! Chased him out the door and down the street!</p>\n<p>It had, of course, been successful, though he rather loathed having to take the form of that oafish muggle. Just the thought of it made his lips curl into a snarl. Filthy.</p>\n<p>But it had all been for Harry. The Ministry sent Marge to St. Mungo's, where she would be healed and obliviated. They had offered they Dursleys several healing potions, but Tom had vehemently denied them- no doubt the muggles would rather suffer through several days of lingering effects of the confundus before accepting magical help.</p>\n<p>He paused in front of a display of potions, slim and oblong bottles of varying colors and clarity, yellowing tags wrapped around the necks of them with their price. He picked up a bottle of something dark silver, metallic and shimmery as he held it up to the light. </p>\n<p>“Elixir of Odium,” a voice said, and he turned to find the shopkeep- an attractive woman with waist length straight black hair and dark olive skin- approaching him. “Even a drop of it can inspire one to give in to their darkest and most poisonous hatred. Turn friends into enemies, lovers into bitter rivals.”</p>\n<p>He quirked a brow. “What if I just wanted it for some fun? As in making a family tear each other a part? Literally.”</p>\n<p>She grinned, gray eyes flicking over him slowly, drinking in his appearance before leaning forward, exposing more of her breasts to him. “I'd say you and I have a very different idea of fun.”</p>\n<p>He frowned, settling the bottle back on the table before leaving, ignoring her calls to come back. Snake oil salesmen. Knockturn Alley was overrun with them.</p>\n<p>No matter, he could teach the Dursleys a lesson without their assistance.</p>\n<p>When he was through with them, they would regret ever laying a finger on his Harry.</p>\n<p>His horcrux.</p>\n<p>-xXx-</p>\n<p>Beauxbatons really was a lovely school, with all the charm and romance one would come to expect from France. It was smaller than Hogwarts had been, and the entire castle was raised on large, arched pillars over the river that ran through the countryside. The water was clear and pristine, the brilliant rock bed below the surface displaying an array of colors. Of greens and grays and blues. Wildflowers grew along the side of it, lilies and daisies racing on the water's edge, coloring the landscape in yellows and pinks. </p>\n<p>The castle itself, from where it sat above the running water, was built in white stones, ivy growing over top it, snaking over the rough texture of the exterior. It stood clear among the world, no trees to hide behind, no mountains to be nestled in. It was surrounded only by a large valley of sweet and spicy herbs, of aromatic flowers. There was, not too far in the distance, a stable house, equally as stately as the castle itself. The silvery sheen of the Unicorns' coats could be seen from across the way, brilliant in the glow of the orange sun. </p>\n<p>Really, it was very lovely, with high ceilings that contained picturesque and dizzying murals, so intricate that one would make themselves sick as they leaned back to take in the view of it all, turning about in circles. Paintings of all things lovely; of Aphrodite born from sea foam, of swans swooning through a blue sky, dancing around chubby cherubs with protruding bellies and full cheeks, golden curls. With tall windows and parapets, stained glass inlaid so that when the sun shone through it created a kaleidoscope of colors.</p>\n<p>It was stunning, but it was not home. It was not Hogwarts.</p>\n<p>The soft, silken tendrils of a willow tree shrouded Harry from the world beyond it, from the field and the gardens that enveloped the castle. It was cool and dark, bits of sunlight streaming through the small spaces left between the slim and looming branches. It was the first day of term, and he had already started off on quite the wrong note.</p>\n<p>He was supposed to be in class- History of Magic to be exact, but it had all been too much. Too overwhelming.</p>\n<p>From the feel of Hermione's small arms as they wrapped around him, and the hurt look on her face when he had not returned the embraced, slinking away from her and disappearing into the crowd (Ginny was dead and it was all his fault and his parents were killed protecting him and he was cursed and he would not drag anyone else down with him, no matter how much his heart ached at the absence.) From the food served at breakfast which was alright but not like Hogwarts's feasts- croissants and fruit and soft cheeses instead of hearty porridge and plump sausage which burst with oil when pierced with the prongs of a fork. </p>\n<p>From the tilted accents. From the unfamiliar faces.</p>\n<p>But he had managed. He had gotten through the morning well enough, quiet and to himself and with his head bowed. It hadn't been until lunch that it had decided he couldn't do it any further, when he had risen from his seat- plate untouched, and left the hall with a racing heart. A letter clutched in his fist, dropped on his lap by an unknown owl, with his name written on the envelope in a terribly familiar scrawl. </p>\n<p>History of Magic had started ten minutes ago, and instead of sitting in class, he was hidden by the shadow of a looming tree, a wrinkled letter from Tom Riddle in his hands.</p>\n<p>He toyed with the envelope, fingernails dragging over the wax seal until there was bits of smooth silver wax stuck under them. He would not open it. Not now. Perhaps not ever. He unwound the cord bunching together his rucksack, tossing the letter inside, where it would be out of sight though not out of mind. He couldn't imagine Tom ever would be.</p>\n<p>He had wound himself in to the wrinkled organ that was his brain, wrapping around the synapses and the amygdala and all the other primitive parts. The parts that dictated fear, terror. </p>\n<p>He stifled a yawn, pressing a hand against his mouth. He hardly slept the night prior, a bundle of nervous energy about the unfamiliar surroundings, the place that was an impostor of the school he had known (it was fine, but it wasn't home) and even when he had managed to fall asleep, he was startled awake by a nightmare.</p>\n<p>Blood warped pages, dark blue eyes flashing crimson.</p>\n<p>He was haunted by the ghosts of things he couldn't quite forget, things he couldn't really remember. </p>\n<p>And yet, the air was cool and it was dark and quiet and he could hear the water as it ran over the rock bed, could hear the distant sound of songbirds tweeting into the morning. And his head fell to his shoulder, heavy, eyes blinking into the world that became less focused around him.</p>\n<p>He wondered if it was possible to hallucinate if you were tired enough. To see things that weren't there as your brain ebbed between consciousness. It must be.</p>\n<p>He could have sworn he saw a large and mangy black dog in the distance, only seconds before his eyes closed for good, snoring softly beneath the canopy of leaves.</p>\n  </div>"
}]